{
"a2_3X_1":"秉佛密意，戒法兼收，七衆咸備，戒海一滴，大科十門，\n律海選七，定道選二，比丘日誦，選擇心要……。（《基本三學》九八頁）\n",
"a2_3X_2":"以下引文出《律海心要廣解》，全稱《律部顯明燈調伏藏\n大海心要廣解》，全八卷，祖師造，智慧幢大師廣解，能海上師譯並作眉批。卷一、二、三\n、八通在家二衆，載《能海上師全集》第四輯《在家律要》（餘卷屬出家部份，故從略），\n上海佛學書局印行。\n",
"a2_3X_3":"《律海心要廣解》卷一。（《在家律要》七〇～七二頁）\n",
"a2_3X_4":"《律海心要廣解》卷一：「律藏中心業果微細理，菩薩緣\n覺聲聞力難知，自力現量行境不共故，而況習惑我見云何曉。【眉批】：深自慚愧，依教修\n行，放下一切我執知見。」（《在家律要》六〇頁）\n",
"a2_3X_5":"《律海心要廣解》卷一。（《在家律要》八二頁，以下引文出處略）\n",
"a2_3X_6":"《俱舍論頌疏》卷一三：「戒爲堤塘證者，又契經說，離\n殺等戒，名爲堤塘戒。能長時相續，堰遏犯戒過故。此經既說戒爲堤塘，明知別有無表戒色\n。……第七別解脫戒者，亦思種爲體，於此思種上，有防非、止過功能，假立無表。故論云\n：謂由思願力，先立要期能定遮防身語惡業，由此故建立別解脫律儀。第八戒爲堤塘者，論\n云：謂先立誓限，定不作惡，後數憶念，慚愧現前，能自制持，令不犯戒。故堤塘義，由心受持。」\n",
"a2_3X_7":"《論》卷四：「博朵瓦云：若數數思，漸能深信，漸淨相\n續，能得加持。由於此上獲得定解，故能由其誠心歸依，若於所學能正習學，則一切事悉成\n佛法。吾等對於諸佛妙智，尚不計爲準洽占卜。此復說云：譬如有一準利卜士說云，我知汝\n於今年無諸災患，則心安泰。彼若說云，今歲有災，應行此事，彼事莫爲，則勵力爲；若未\n能辦，心則不安，起是念云，彼作是說，我未能辦。若佛制云，此此應斷，此此應行，豈置\n心耶？若未能辦，豈憂慮耶？反作是言，諸教法中，雖如彼說，然由現在，若時若處，不能\n實行，須如是行。輕棄佛語，唯住自知。若不觀察，隨心愛樂，唯亂於言。若非爾者，內返\n其意，詳細觀察，極爲諦實。故當數數思佛功德，勵力引發至心定解。此若生者，則於佛所\n從生之法及修法眾，亦能發起如是定解，是則歸依至於扼要。此若無者，即能轉變心意歸依\n，且無生處，況諸餘道！」\n",
"a2_3X_8":"《律海心要廣解》卷二。（《在家律要》九一頁）\n",
"a2_3X_9":"七佛　過去之七佛。其七佛出世教化之相，說於長\n阿含卷一之大本經及增一阿含卷四十四之十不善品。其他有七佛父母姓字經，七佛經之別譯\n，七佛名號少異，同一梵語之轉訛也。\n",
"a2_3X_10":"《律海十門》：「若侵損僧物，隨愛憎取與，不護惜\n浪用，愚癡波羅夷，望十方圣凡，各各成盜罪，勝五逆四重，無法能除悔。」（四根本修心\n要門第六之盜戒攝修）\n",
"a2_3X_11":"《律海十門》：「依諸教所云，執掌三寶物，羅漢須\n陀洹，無則持淨戒，識因果業報，畏后世慚愧，克我執知悔，分物心等平。」\n",
"a2_3X_12":"《律海十門》四根本修心要門第六之殺戒攝修。（《\n基本三學》第八二頁）\n",
"a2_3X_13":"不談世事　宋光孝安禪師，住清泰寺。定中見\n二僧倚檻相語，初有天神擁衛傾聽，久之散去；俄而惡鬼唾罵，乃掃腳跡。詢其故，乃二僧\n初論佛法，次敘間闊，末談資養。安自是終年未嘗言及世事。讚曰：古人爲生死行腳，才逢\n師友，惟汲汲商略是事，何暇他論？今人終日雜話，求如二僧，亦不可復得；鬼神在側，又\n當如何？噫，可懼也已！（《緇門崇行錄》）\n",
"a2_3X_14":"四依－行四依　謂出家之人，依此四法而修，\n則能成就聖道也。  一、著糞掃衣。著糞掃衣者，謂視同糞土，掃除不用，即世人所棄弊\n垢之衣也。修道之人當收拾淨洗，補湊穿著，如此則心無所戀，能成道業矣。  二、常行\n乞食。乞食者，謂出家之人，常以乞食自活其命也。  三、樹下坐。樹下坐者，謂出家之\n人，不宜營治舍宅，當於樹下或石窟中，隨便而居，修習禪定也。　四、用陳腐藥。用陳腐\n藥者，謂出家之人，若患病時，當用陳年朽腐之藥而調治之，病瘥即止；不得貪樂新好藥物\n而預積蓄也。\n",
"a2_3X_15":"《舍利弗阿毘曇論》卷一四非問分禪定品第九：「因\n緣具足，則能得定，因緣不具，不能得定。修定有如此因緣，謂比丘愛護解脫戒，成就威儀\n行，已行處，愛護微戒懼如金剛，受持於戒，斷邪命行正命，善知識，善親厚，善眾，攝諸\n根門，飲食知足，勤行精進初不睡眠，離障礙法。如此比丘，知斷五蓋心垢，損智慧法，離\n欲惡不善法，有覺有觀，離生喜樂，成就初禪行，乃至斷苦樂，先滅憂喜，不苦不樂捨，念\n，淨，成就第四禪行。」\n",
"a2_3X_16":"《西域記》卷五：「城西南五六里大庵沒羅林中，有\n故伽藍，是阿僧伽（唐言無著）菩薩請益導凡之所。無著菩薩夜升天宮，於慈氏菩薩所，受\n瑜伽師地論莊嚴大乘經論中邊分別論等，晝爲大衆講宣妙理。庵沒羅林西北百餘步，有如來\n髮爪窣堵波。其側故基，是世親菩薩從睹史多天下見無著菩薩處。無著菩薩，健馱邏國人也\n，佛去世後一千年中，誕靈利見，承風悟道，從彌沙塞部，出家修學，頃之回信大乘。其弟\n世親菩薩，於說一切有部，出家受業，博聞強識，達學研機。無著弟子佛陀僧訶（唐言師子\n覺）者，密行莫測，高才有聞。二三賢哲，每相謂曰：凡修行業，願覲慈氏；若先捨壽，得\n遂宿心，當相報語，以知所至。其後師子覺先捨壽命，三年不報。世親菩薩，尋亦捨壽，時\n經六月，亦無報命。時諸異學，咸皆譏誚，以爲世親菩薩及師子覺流轉惡趣，遂無靈鑒。其\n後無著菩薩於夜初分，方爲門人教授定法，燈光忽翳，空中大明；有一天仙，乘虛下降，即\n進階庭，敬禮無著。無著曰：爾來何暮？今名何謂？對曰：從此捨壽命，往睹史多天慈氏內\n衆蓮華中生。蓮華才開，慈氏讚曰：善來廣慧，善來廣慧。旋繞才周，即來報命。無著菩薩\n曰：師子覺者，今何所在？曰：我旋繞時，見師子覺在外衆中，耽著欲樂，無遐相顧，詎能\n來報。無著菩薩曰：斯事已矣。慈氏何相？演說何法？曰：慈氏相好，言莫能宣。演說妙法\n，義不異此。然菩薩妙音，清暢和雅；聞者忘倦，受者無厭。」\n",
"a2_3X_17":"《戒定慧基本三學》之《科頌》第二七頁，上海佛學書局印行。\n",
"a2_3X_18":"正學女：即式叉摩那，《俱舍論記》卷十四：「式叉\n摩那，唐言正學。正謂正學六法。言六法者，謂不婬、不盜、不殺、不虛誑語、不飲諸酒，不非時食。」\n",
"a2_3X_19":"煙草之毒害（節錄孫景風居士西藏經典譯文）\n：本師釋迦牟尼佛在龍宮勝王處，正入定時，有名魔天施之二魔女，愛戀世尊，趨至佛前，\n大獻媚術，佛從定起，作一彈指，二女即入昏沈，及其覺時，自見形態變爲龍鍾老嫗，大生\n慚恚，逃於他方，共相議曰：我二人不能壞佛戒體，何不發一反願，於其隨順眾生中，安一\n惡種子，言已，次魔女取胎血，拋向印度國，長魔女取便溺，拋向中華國，由是從胎血種子\n，播生煙草，從便溺種子，播生大蒜，煙蒜二者，一入口中，眾生即當墮入地獄，以其由發\n反願所生，且於佛前所發反願，較其他一切之力，大而有餘故也。\n　　吸食之害，不生三戒本續中，三毒俱備故也，不生六度本續中，六垢俱備故也，不容觀\n修生起次第，以其於佛前觸犯其障故也，不容觀修圓滿次第，以一切根本道，爲煙所障故也\n，不容趨至三寶佛殿前，以減少彼等之功德故也，煙氣上行至天宮，觸於天帝釋及梵天等，\n阻瑜伽道，及見修二道，中行至人間，觸尋香無色，及饒益眾生之護法，令其昏昧，則護法\n勢力衰弱，而資糧道隔絕矣，若作佛之近侍，則觸佛障，雖有念誦功德，縱經百劫，亦不生\n微若芥子許之效果，及至臨命終時，於法身出現之際，中脈上端，以爲煙所遮，則靈性流轉\n於下，於中陰報身出現之際，雖現天身，以爲煙所覆蔽，無所見而失墮於中陰，於出現化身\n之際，不得貴族善種眾生之胎，以煙根源，是由胎血火中焚化，而成吸者邪緣之因故也。\n　　清晨吸煙，阻斷動脈流行，臨命終時，不容或現光明；午間吸煙，阻斷靜脈流行，於中\n陰時，不容現報身；昏暮吸煙，阻斷中脈上端，於投生時，不容或現化身，何況煙氣惡劣，\n當爲諸善士所共棄也，大蒜及蔥，攝彼類中，亦應永斷，而以煙草毒害最甚，若不戒斷，終\n必符合世尊已往金口誠言，今世貧窮，漸至墮於惡趣，身色不美，而受生於污穢之處，蓋吸\n煙者，多半生於不淨之中，及食便溺者之族類中也！\n　　戒除之法，須向三寶前，作虔誠念，於諸有情，生慈悲心，常誦伏魔咒，乃能淨除矣（\n咒文頗長，音恐難確，故未錄，若能至誠懇切，念佛號以代之，必有同樣功效，以一聲佛號\n，能除多劫生死重罪也）。吸煙成癮之人，有以仇視心理，誓願戒除，而終不能戒除者，以\n有昔日魔女惡願加持，生生世世，未曾捨棄，故非下大決心，求佛加被不可。\n　　孫景風曰：此文由龍樹菩薩札記中錄出，所論煙草之害，較五葷尤烈，讀之令人毛悚！\n念佛持咒人，若有煙癖，最爲護法神所惡，不爲呵護，天龍八部，亦最畏煙氣薰障，人間煙\n氣熾盛，則旱魃爲虐，雨量不調，災害並至！人若平時爲煙氣所薰染，臨命終時，神識即隨\n煙氣入地獄，蓋煙氣閉塞頂門，不能往生，平時雖念佛持咒功深，斯時亦作不得主，思之更\n爲可怖！附志數言，普願有情，速成正覺！（謹按：吸煙（卷煙絲煙之類）傷身體，促壽命\n，費金錢，致貧窮，其害猶小，大害甚多，約有二端。一． 吸煙者，雖有念佛誦經咒之功\n德，縱經百劫，亦不生微若芥子許之效果。二． 吸煙者，平時吸煙爲氣所薰染，臨終頂門\n閉塞，不能往生，反隨煙氣墮入地獄。）\n",
"a2_3X_20":"踰繕那　此云限量，又云合應（計應合爾許度\n量）。業疏云：此無正翻，乃是輪王巡狩一停之舍，猶如此方館驛。西域記云：夫數量之稱\n踰繕那者，舊曰由旬，又曰踰闍那，又曰由延，皆訛略也。踰繕那者，自古聖王一日軍行，\n舊傳一踰繕那四十里，印度國俗乃三十里，聖教所載唯十六里。大論云：由旬三別，大者八\n十里，中者六十里，下者四十里。謂中邊山川不同，致行里不等。窮微之數，分一踰繕那爲\n八拘盧舍，分一拘盧舍爲五百弓，分一弓爲四肘，分一肘爲二十四指，分一指節爲七宿麥，\n乃至虱蟣隙塵，牛毛羊毛兔毫同水。次第七分以至細塵，細塵七分爲極細塵，極細塵者不可\n復析，析即歸空，故曰極微也。俱舍頌曰：極微微至水，兔羊毛隙塵，蟣虱麥指節，後後增\n七倍。二十四指肘，四肘爲弓量，五百俱盧舍，此八踰繕那。\n",
"a2_3X_21":"《賢愚經》卷五“沙彌守戒自殺品”。\n",
"a2_3X_22":"《大佛頂如來密因修證了義諸菩薩萬行首楞嚴經》卷\n八：「云何助因？阿難，如是世界，十二類生，不能自全，依四食住，所謂段食、觸食、思\n食、識食，是故佛說一切眾生皆依食住。阿難，一切眾生，食甘故生，食毒故死。是諸眾生\n，求三摩提，當斷世間五種辛菜。是五種辛，熟食發婬，生啖增恚。如是世界食辛之人，縱\n能宣說十二部經，十方天仙嫌其臭穢，咸皆遠離；諸餓鬼等，因彼食次，舐其唇吻，常與鬼\n住，福德日銷，長無利益。是食辛人，修三摩地，菩薩天仙、十方善神不來守護，大力魔王\n得其方便，現作佛身，來爲說法。非毀禁戒，讚婬怒癡，命終自爲魔王眷屬；受魔福盡，墮\n無間獄。阿難，修菩提者，永斷五辛，是則名爲第一增進修行漸次。」\n",
"a2_3X_23":"《俱舍論頌疏》卷四：「頌曰：無慚愧不重，於罪不\n見怖；愛敬謂信慚，唯於欲色有。釋曰：無慚愧者，標也；不重者，釋無慚也。不重賢善，\n名爲無慚。謂於功德，及有德人，無敬無崇，無所忌難，無所隨屬，說名無慚，即是恭敬所\n敵對法。言功德者，戒定慧功德也；有德人者，具戒定慧人也；無忌難者，無畏懼也；不隨\n屬者，不作弟子禮也。於罪不見怖者，釋無愧也。謂諸善士，所呵厭法，說名爲罪，於此罪\n中，不見能招可怖畏果，說名無愧；此中怖言，顯非愛果，能生怖故　有餘師說，於所造罪\n，自觀無恥，說名無慚；觀他無恥，說名無愧。慚愧差別，翻此應知。謂翻初釋，有敬有崇\n，有所忌難，有所隨屬，說名爲慚；於罪見怖，說名爲愧。翻第二釋，於所所造罪，自觀有\n恥，說名爲慚；觀他有恥，說名爲愧。」\n",
"a2_3X_24":"《現證莊嚴論》頌云：「約南洲士夫，供佛善根等，\n多種喻所作，增盛十六相。」\n",
"a2_3X_25":"《現證莊嚴論·文句頌解》七十義之四十三：「一、\n此三千大千世界之中，南嚴浮提之有情不惜財貨，特能於如來所，作特殊之供養。二、特於\n般若波羅蜜能作意念（印順接近）。三、能得無生法忍（一切法無生心能忍許）。四、於所\n應作之菩提及能作之諸法，能無所緣。五、於十善等（四靜慮）及無色之修習悟入易得。六\n、接近諸天鄰次之下。七、自能鎮伏諸魔勢力。八、與導師及相同之士夫共在一處（有與佛\n血統關繫）。」\n　　「復次：一、一切種種善巧方便學處完全清淨（別解脫戒能全受，受已清淨護持）。二\n、具足成就如來種性（利他）。三、能得佛果之因相具足（悲心、菩薩行）。四、於波羅蜜\n反背方面心意不生。五、於色等及俱有，具足之觀念心非熾然生（於五塵境不深染著）。六\n、普攝廣大波羅蜜能正知（《大般若》全部教理能知）。七、一切圓滿成就能得（依教修行\n能得大般若）。八、正等圓滿菩提相近隨順轉成（易成正等菩提）。」\n　　《清涼記》：「此十六中，前八爲生南洲人之共法，後八爲即生能成大般若之特法，生\n圓次第中說，即身成佛，必須具此十六殊勝性。」\n　　《掌中解脫》（三八五頁）：「初業行人於一生中即身成佛之身，也必須是『業地』贍\n部洲具有六界（肉、皮、血、骨、髓、精，前三者來自母親，後三者來自父親）的胎生人身\n。……我們發願的對象通常是極樂淨土，而極樂的菩薩們卻發願要受生到此洲來。所以，我\n們衹是男兒不自強罷了。」\n",
"a2_3X_26":"外道經書中雜有佛菩薩名號或法寶字句，可先念請聖\n回駕咒七遍，然後淨地焚之。損像蠹經，淨處藏之亦可。\n",
"a2_3X_27":"《大般若波羅蜜多經》卷四九八：「復次憍尸迦，若\n菩薩摩訶薩起應一切智智心，以無所得爲方便，思惟無明緣行，行緣識，識緣名色，名色緣\n六處，六處緣觸，觸緣受，受緣愛，愛緣取，取緣有，有緣生，生緣老死乃至純大苦蘊集已\n，復以無所得爲方便，思惟無明滅故行滅，行滅故識滅，識滅故名色滅，名色滅故六處滅，\n六處滅故觸滅，觸滅故受滅，受滅故愛滅，愛滅故取滅，取滅故有滅，有滅故生滅，生滅故\n老死乃至純大苦蘊滅。如是諸滅，無我空無相無願，寂靜遠離，無生無滅，無染無淨，無作\n無爲。憍尸迦，是謂菩薩摩訶薩甚深般若波羅蜜多。」\n　　于凌波《唯識名詞白話新解》：十二有支流轉門，是順觀十二因緣，即有情生命流轉的\n因果，此流轉門，相當於四聖諦中的苦、集二諦。如《緣起經》曰：「依此有故彼有，此生\n故彼生。所謂無明緣行、行緣識、識緣名色、名色緣六入、六入緣觸、觸緣受、受緣愛、愛\n緣取、取緣有、有緣生、生緣老死，起愁、嘆、苦、憂、惱，是名純大苦蘊集。」 十二有\n支還滅門，是逆觀十二因緣，有情生死還滅的因果，即解脫的因果。如《過去現在因果經》\n謂：「若滅無明則行滅，行滅則識滅，識滅則名色滅，名色滅則六入滅，六入滅則觸滅，觸\n滅則受滅，受滅則愛滅，愛滅則取滅，取滅則有滅，有滅則生滅，生滅則老死憂悲苦惱滅。\n」此還滅門，相當於四聖諦中的滅道二諦。\n",
"a2_3X_28":"具德師父標準　丙二 所親近之德分十\n　丁一 調伏：與戒相應者。丁二 寂靜：與定相應者。丁三 惑除：與慧相應伏斷煩惱者\n。丁四 德增：戒定慧具不缺不減者。丁五 有勇：益他無畏無倦者。丁六 經富：有多聞\n者。丁七 覺真：了實義者。丁八 善說：不顛倒者。丁九 悲深：無希求者。丁十 離退\n：於一切時恭敬說者。\n　　頌云：調伏寂靜斷伏惑，德增有勇阿含富，覺真善說悲願廣，離退十德堪親近。若無全\n具此十德，應具悲心與調伏。　“調伏寂靜斷伏惑”，這是第一二三個：調伏，寂靜，斷伏\n惑就是惑除；“德增有勇”，第四個就是德增，第五個是有勇，第六個是“阿含富”，學得\n多的，三藏多聞的；“覺真”，第七個，能夠通達實相的，或者證到實相的；第八個“善說\n”，善巧說法的；第九個“悲願廣”，悲深；第十，“離退”。這個十個功德具足的，“堪\n親近”，能夠親近他。　“若無全具此十德，應具悲心與調伏。”假使十個功德不能全的，\n那麽根據博多瓦的五個，戒定慧，達實性，還有悲心，這五個；如果這五個還不夠，那就是\n要具“悲心”跟“調伏”。而先決條件是調伏，調伏有了之後，還有悲心。有這兩個條件的\n，就可以親近。假使這兩個條件沒有的，尤其是沒有調伏的，再好，不能親近。這個話是传\n承師長海公上師親自傳下來的。……十個條件具足的是具德師父，不具足的，五個；再不行\n的，兩個。兩個再不行的，不行了。這兩個是不能少了。就是一個戒，一個悲心。這個就是\n最起碼最起碼的。 （《科頌講記》）\n",
"a2_3X_29":"《付法藏因緣傳》卷三：「時摩突羅城有一婬女名婆\n須達。多諸邪媚，妖幻姦諂，遣使詣市，求買妙花。使人尋往憂波毱所，大得好花，奉婆須\n達。女怪華多，問使人曰：汝將不盜得是花耶。使人答言：我不盜得，從市買之，有人名曰\n憂波毱多，仁慈寬惠，性好平均，以斯因緣，得多花耳；又復此人形容姿麗，大家若見，死\n終無恨。時婆須達遣人迎召，憂波毱多都不許可。慇懃求請，終不移操。有長者子，共婬女\n宿，值有估客從遠方來，大齎珍寶，求女交通。時彼女人貪其寶故，殺長者子，埋置舍內。\n其家眷屬，遍行推求，至婬女舍，掘地得女，向其國王具陳斯事。即取婬女，斬截手足，劓\n其耳鼻，棄於塜間。憂波毱多作是念曰：彼以榮色本來召我，以是因緣，止而不去，今爲解\n脫，宜往化之。即將侍者至婬女所。婆須達言：我本端妙，顏容姿瑋，爾時相召，不能臨顧\n，今既殘毀，何用來爲。答言：姊妹，我爲觀汝實相故來，不爲欲也。汝本以色誑惑眾生，\n凡夫無智，橫起倒想。今自應當諦觀此色，無常危脆，猶如聚沫，覆以薄皮，外現嚴飾；筋\n骨相連，涕唾不淨。譬如畫瓶，盛滿臭穢，愚不覺知，深生染愛；智者了之，終不樂著。假\n以香華，澡浴衣服，外現莊嚴，內實不淨。大海淵廣，可知渧數，此身過患，甚難窮盡。是\n故諸佛恒常訶責，未曾一念生願樂想。婬女於時心漸開悟，於佛法中，深生敬信，白言：仁\n者所說誠諦，唯願爲我廣敷演之。優波毱多即爲宣暢，一切有爲，眾苦積聚，如癰如瘡，如\n箭入心，生老病死，輪轉無際，無常敗壞，不堅速朽。如臨死囚，命不云遠。譬如牢獄，人\n無愛樂。猶路上果，眾所共擲。此身可惡，會歸磨滅，烏鵲狐狼，競共噉食。風吹日曝，青\n爛臭處，髮毛爪齒，狼藉在地。如此之身，豈可愛樂。宜勤方便，而求解脫。婬女聞解，得\n法眼淨，命終即生三十三天。」\n",
"a2_3X_30":"《影塵回憶錄》：「朱子橋將軍，多少年來羡慕弘老\n的德望，只是沒見過面。正趕他有事到青島，讓我介紹欲拜見弘老，一說，弘老很樂意。大\n概他平素也知道朱將軍之爲人，對辦慈善及對三寶事很熱心，乃與之接見，並沒多談話；同\n時還有要見他的人，他不見，讓人回答，說已竟睡覺了。\n　　有一天，沈市長在湛山寺請朱將軍吃飯，朱將軍說：可請弘老一塊來，列一知單，讓他\n坐首席，我作配客。沈市長很同意，把知單寫好，讓我去給弘老說，我到他寮房裏一說，弘\n老笑笑沒言語，我很知他的脾氣，沒敢再往下勉強。第二天臨入席時，又派監院師去請他，\n帶回一個條來，上寫四句話：昨日曾將今日期，短榻危坐靜思惟；爲僧只合居山穀，國士筵中甚不宜。\n　　朱將軍看到這個條喜的不得了，說這是清高。沈市長臉上卻顯得很不樂意，按地方官來\n說，他是一個主人，又加是在一個歡迎貴賓的場合裏，當然於面子上有點下不來台。我和朱\n將軍看到這裏，趕緊拿話來遮蓋，朱將軍平素有些天真氣派，嘻嘻哈哈，把這個澀羞場面給\n遮掩過去了。」\n",
"a2_3X_31":"守財鬼 ：《六趣輪迴經》卷一：若人於財利\n　　勞役廣希求　　無少惠施心　　後作守財鬼\n　　若人盜他財　　用已或能施　　後墮鬼趣中　　隨得隨散失　　若人於己財　　隨分而行施\n當獲於富饒　　不爲他侵損　　若人以淨財　　離慳廣行施　　得上妙飲食　　所欲皆如意\n",
"a2_3X_32":"《史記》卷八六“刺客列傳第二六”：「智伯伐趙襄\n子，趙襄子與韓、魏合謀滅智伯，滅智伯之后而三分其地。趙襄子最怨智伯，漆其頭以爲飲器。」\n",
"a2_3X_33":"《四十二章經》：「佛言：人遇吾以爲不善，吾以四\n等慈護濟之；重以惡來者，吾重以善往。福德之氣，常在此也；害氣重殃，反在于彼。有愚\n人聞佛道，守大仁慈，以惡來，以善往，故來罵佛。佛默然不答，愍之，癡冥狂愚使然。罵\n止，問曰：子以禮從人，其人不納，寶禮如之乎？ 曰：持歸。今子罵我，我亦不納，子自\n持歸。禍子身矣！猶響應聲，影之追形，終無免離。慎爲惡也。」\n",
"a2_3X_34":"歌利王害忍辱仙　《金剛經》：「須菩提，忍\n辱波羅蜜，如來說非忍辱波羅蜜，是名忍辱波羅蜜。何以故？須菩提，如我昔爲歌利王割截\n身體，我於爾時，無我相無人相無眾生相無壽者相。何以故？我於往昔節節支解時，若有我\n相人相眾生相壽者相，應生瞋恨。須菩提，又念過去於五百世，作忍辱仙人，於爾所世，無\n我相無人相無眾生相無壽者相。是故須菩提，菩薩應離一切相，發阿耨多羅三藐三菩提心。\n不應住色生心，不應住聲香味觸法生心，應生無所住心。若心有住，則爲非住。」\n　　《大般涅槃經》卷三一：「善男子，我念往昔生南天竺富單那城婆羅門家，是時有王，\n名迦羅富，其性暴惡，憍慢自大，年壯色美，耽着五欲。我於爾時，爲度眾生，在彼城外，\n寂默禪思。爾時彼王，春木花敷，與其眷屬，宮人婇女，出城遊觀，在樹林下五欲自娛。其\n諸婇女，捨王遊戲，遂至我所。我時欲爲斷彼貪故，而爲說法。時王尋來，即見我時，便生\n惡心，而問我言：汝今已得羅漢果耶？我言不得。復言：獲得不還果耶？我言不得。復作是\n言：汝今若未得是二果，則爲具足貪欲煩惱，云何自恣觀我女人？我即答言：大王，當知我\n今雖未斷於貪結，然其內心，實無貪著。王言：癡人，世有諸仙，服氣食果，見色猶貪，況\n汝盛年，未斷貪欲，云何見色而當不貪？我言：大王，見色不著，實不因於服氣食果，皆由\n繫心無常不淨。王言：若有輕他而生誹謗，云何得名修持淨戒？我言：大王，若有妬心，則\n有誹謗；我無妬心，云何言謗？王言：大德，云何名戒？大王，忍名爲戒。王言：若忍是戒\n者，當截汝耳，若能忍者，知汝持戒。即截其耳。時我被截，顏色不變。時王群臣，見是事\n已，即諫王言：如是大士，不應加害。王告諸臣：汝等云何知是大士？諸臣答言：見受苦時\n，容色不變。王復語言：我當更試，知變不變。即劓其鼻，刖其手足。爾時菩薩，已於無量\n無邊世中修習慈悲愍苦眾生，時四天王，心懷瞋忿，雨沙礫石。王見是已，心大怖畏。復至\n我所，長跪而言：唯願哀愍，聽我懺悔。我言：大王，我心無瞋，亦如無貪。王言：大德，\n云何得知心無瞋恨？我即立誓：我若真實無瞋恨者，令我此身平復如故。發是願已，身即平復。」\n",
"a2_3X_35":"汝若能爲大法王，正治其罪，庶汝之所言，舉世奉行\n矣。否則即是山野愚民，妄稱皇帝，自制法律，背叛王章，不旋踵而滅門誅族矣。（《增廣\n印光法師文鈔》卷二）\n",
"a2_3X_36":"恃相卅八法 （舍利弗論 煩惱品）：\n恃我慢憍勝，無明顛倒始，煩惱諸行生，内慧行自照。初叚有十法，恃生恃種姓，恃色恃財\n福，恃貴恃尊勝，恃豪族無病，恃年壯命壯，皆屬生身執，不可依作依；次叚十二法，恃工\n巧多聞，辯才得利養，得恭敬尊重，恃備足師範，恃徒眾黨侶，恃長宿恃力，皆從我所生；\n后叚十六法，恃神足禪定，恃無求知足，獨處阿練若，恃乞食糞掃，離荒食一受，恃冢間露\n處，樹下常端坐，隨坐但三衣（增），如是十六法，皆三學杜多，佛讚勝功德，不恃則爲妙\n，内慧行之基。（《戒定慧基本三學》三〇八頁）\n　　《舍利弗阿毘曇論》卷一八，非問分煩惱品第十一：有一人出世，如來無所著等正覺，\n斷惡不善法，生諸善法，斷苦法，得樂法，寂靜諸漏，滅諸漏，除諸所作業，能得寂靜第一\n義清涼，究竟盡，究竟梵行，究竟安樂，究竟苦際，得涅槃。以是因緣故，今當集諸不善法\n門。恃生，恃姓，恃色，恃財，恃貴，恃尊勝，恃豪族，恃無病，恃年壯，恃命，恃工巧，\n恃多聞，恃辯才，恃得利養，恃得恭敬，恃尊重，恃備足，恃師範，恃戒，恃徒眾，恃黨侶\n，恃長宿，恃力，恃神足，恃禪，恃無求，恃知足，恃獨處，恃阿蘭若，恃乞食，恃糞掃衣\n，恃我能離荒食，恃一受食，恃冢間，恃露處，恃樹下，恃常端坐，恃隨敷坐，恃但三衣…\n…。何謂恃生？眾生貴生，以生自高，以生爲境界，若心憶念，謂生妙好，而以自高，是名\n恃生。復次恃生，我生勝彼中生，彼生卑，世間諸生中我生最勝。眾生重於生，常敬於生，\n若心憶念諸生妙好，而以自高，是名恃生。恃姓、恃色、恃財貴、恃尊勝、恃豪族、恃無病\n、恃年壯、恃命壯、恃工巧、恃多聞、恃辯才、恃得利養、恃得恭敬、恃尊重、恃備足、恃\n師範、恃徒眾、恃黨侶、恃長宿、恃力、恃神足、恃禪、恃無求、恃知足、恃獨處、恃阿蘭\n若、恃乞食、恃糞掃衣、恃我能離荒食、恃一受食、恃冢間、恃露處、恃樹下、恃常端坐、\n恃隨敷坐、恃但三衣，亦如上廣說。」\n",
"a2_3X_37":"《科頌·入般若法門》：「般若謂正知，遠離顛倒類\n；般若者真見，不觀夢幻實，不住色生心，合集流注等；般若者純淨，我相塵垢離。」（《\n戒定慧基本三學》四四頁）\n",
"a2_3X_38":"《十二門論宗致義記》卷一：「設有處說緣生空者，\n應知此就遍計所執，說緣生法無二我故。密意言空，非謂彼法舉體全無。若此無者，則是斷\n無惡取空見，甚爲可畏。經云：寧起有見如須彌山，不起空見如芥子許。中論云：若復見於\n空，諸佛所不化。如是空見，既是深過；明知緣生，必定不無，攝論瑜伽深密經等決定說有\n，不可違故。」 《大乘密嚴經》卷三：「譬如須彌量，我見未爲惡；憍慢而著空，此惡過\n於彼。空性隨應說，不應演非處；若演於非處，甘露即爲毒。一切諸眾生，生於種種見，欲\n令斷諸見，爲說於空理，聞空執爲實，不能斷諸見，此見不可除，如病醫所捨。」 《楞伽\n阿跋多羅寶經》卷三：「……大慧，因是故我說寧取人見如須彌山，不起無所有增上慢空見\n。」 《念佛三昧寶王論》卷二：「楞伽密嚴經皆曰寧起有見如須彌者，謂信有因果，存想\n念佛，生極樂淨國，故云寧起有也；不起空見如芥子者，謂撥無因果，謗於念佛，生阿鼻地\n獄，故云不起空也。吁！可畏者，其在茲焉。」\n",
"a2_3X_39":"野狐禪　禪家以外道爲野狐禪。四家玄錄曰：\n「百丈大智禪師，一老人聽法，曰：僧住此山，有人問大修行底人，還落因果也無？遂對曰\n不落因果，墮在野狐禪，請和尚代一轉語。師曰：汝但問。老人便問。師曰：不昧因果。老\n人大悟曰：今已免老狐身，只在山後住，乞依亡僧例焚燒。巖中果見一死狐，積薪化之。」\n",
"a2_3X_40":"《妙法蓮華經》卷一：「佛告舍利弗：如是妙法，諸\n佛如來時乃說之，如優曇鉢華時一現耳。舍利弗，汝等當信佛之所說，言不虛妄。舍利弗，\n諸佛隨宜說法，意趣難解。所以者何？我以無數方便，種種因緣，譬喻言辭，演說諸法，是\n法非思量分別之所能解，唯有諸佛乃能知之。所以者何？諸佛世尊，唯以一大事因緣故出現\n於世。舍利弗，云何名諸佛世尊唯以一大事因緣故出現於世？諸佛世尊，欲令眾生開佛知見\n、使得清淨故，出現於世；欲示眾生佛知見故，出現於世；欲令眾生悟佛知見故，出現於世\n；欲令眾生入佛知見道故，出現於世。舍利弗，是爲諸佛以一大事因緣故出現於世。」\n",
"a2_3X_41":"《瑜伽師地論》卷二二：「尸羅律儀，由十因緣，當\n知虧損；即此相違十因緣故，當知圓滿。云何十種虧損因緣？一者最初惡受尸羅律儀，二者\n太極沈下，三者太極浮散，四者放逸懈怠所攝，五者發起邪願，六者軌則虧損所攝，七者淨\n命虧損所攝，八者墮在二邊，九者不能出離，十者所受失壞。云何名爲最初惡受尸羅律儀？\n謂如有一王所逼迫而求出家，或爲狂賊之所逼迫，或爲債主之所逼迫，或爲怖畏之所逼迫，\n或不活畏之所逼迫而求出家，不爲沙門性，不爲婆羅門性，不爲自調伏，不爲自寂靜，不爲\n自涅槃而求出家。如是名爲最初惡受尸羅律儀。……（中略）略由如是十種因緣，名戒虧損\n。世尊或說尸羅虧損，或時復說尸羅艱難，當知於彼諸因緣中，由二因緣，謂不能出離，及\n所受失壞；由餘因緣，當知唯說尸羅虧損。與此安立黑品因緣，相違白品所有因緣，當知說\n名尸羅圓滿，尸羅清淨。」\n",
"a2_3X_42":"《瑜伽師地論》卷二二：「云何名爲墮在二邊？謂如\n有一耽著受用極樂行邊，從他所得；或法非法，所有衣服飲食臥具病緣醫藥，及諸資具，愛\n玩受用，不觀過患，不知出離，是名一邊。復有一類好求受用自苦行邊，以無量門，而自煎\n迫，受極苦楚，謂依棘刺，或依灰坌，或依木杵，或依木板，或狐蹲住，或狐蹲坐，修斷瑜\n伽；或復事火，謂乃至三，承事於火；或復昇水，謂乃至三，昇上其水；或一足住，隨日而\n轉；或復所餘。如是等類，修自苦行，是第二邊。如是名爲墮在二邊。」\n",
"a2_3X_43":"《賢愚經》卷五，沙彌守戒自殺品：「沙門四種，好\n惡難明，如菴羅果，生熟難知。或有比丘，威儀庠序，徐行諦視，而內具足貪欲恚癡、破戒\n非法，如菴羅果，外熟內生；或有比丘，外行麤踈，不順儀式，而內具足沙門德行、禪定智\n慧，如菴羅果，內熟外生；或有比丘，威儀麤穬，破戒造惡，內亦具有貪欲恚癡、慳貪嫉妬\n，如菴羅果，內外俱生；或有比丘，威儀庠審，持戒自守，而內具足沙門德行、戒定慧解，\n如菴羅果，內外俱熟。彼乞食比丘，內外具足，亦復如是，德行滿故，人所宗敬。」\n",
"a2_3X_44":" 《瑜伽師地論》卷二二：「有處世尊宣說，尸羅名\n爲根本，如伽他說：若善住根本，其心常寂靜，因聖見惡見，相應不相應。有處世尊宣說，\n尸羅名莊嚴具，如伽他說：苾芻苾芻尼，戒莊嚴圓滿，於不善能捨，於善能修習。有處世尊\n宣說尸羅名爲塗香，如伽他說：苾芻苾芻尼，戒塗香圓滿，於不善能捨，於善能修習。有處\n世尊宣說，尸羅名爲薰香，如伽他說：阿難有香類，順風善能薰，逆風亦能薰，順逆薰亦爾\n。有處世尊宣說，尸羅名爲妙行，如伽他說：身妙行能感，可愛諸異熟，於現法當來，語妙\n行亦爾。有處世尊宣說，尸羅名爲律儀，如伽他說：諸有惠施主，具戒住律儀，有阿笈摩見\n，及有果正見。」\n",
"a2_3X_45":"《瑜伽師地論》卷二二：「問：何緣世尊宣說尸羅名\n爲根本？答：能建立義，能任持義，是根本義。由此尸羅建立任持一切世間及出世間，能引\n無罪最勝第一快樂功德，令生令證，是故尸羅說名根本。譬如大地建立任持一切藥草卉木叢\n林，令生令長，如是尸羅，如前廣說。」\n",
"a2_3X_46":"《瑜伽師地論》卷二二：「問：何緣世尊宣說尸羅名\n莊嚴具？答：諸餘世間，耳環指環、腕釧臂釧，及以寶印、金銀鬘等，妙莊嚴具，若有成就\n幼稚黑髮少年，盛壯姝妙形色而服飾之，少增妙好，非有成就朽老衰邁、齒落髮白、年逾八\n十或九十者而服飾之當有妙好，唯除俳戲，令眾歡笑。若遭病苦，財貨匱乏，親戚喪亡，當\n爾服之，亦無妙好。戒莊嚴具，於一切類，於一切時，若有服者，皆爲妙好，是故尸羅名莊嚴具。」\n",
"a2_3X_47":"《瑜伽師地論》卷二二：「問：何緣世尊宣說尸羅名\n爲薰香？答：具戒士夫補特伽羅，遍諸方域，妙善稱譽，聲頌普聞。譬如種種根莖香等，隨\n風飄颺，遍諸方所，悅意芬馥，周流彌遠，是故尸羅名爲薰香。」\n",
"a2_3X_48":"《瑜伽師地論》卷二二：「問：何緣世尊宣說尸羅名\n爲塗香？答：由此所受清淨無罪妙善尸羅，能正除遣一切所受惡戒爲因身心熱惱。譬如最極\n炎熾熱時，塗以栴檀龍腦香等，一切鬱蒸皆得除滅，是故尸羅說名塗香。」\n",
"a2_3X_49":"《瑜伽師地論》卷二二：「問：何緣世尊宣說尸羅名\n爲妙行？答：由此尸羅清淨善行，能趣妙藥，往妙天趣，向妙安隱，故名妙行。」\n",
"a2_3X_50":"《瑜伽師地論》卷二二：「問：何緣世尊宣說尸羅名\n爲律儀？答：由此尸羅清淨善法，是防護性，是息除相，是遠離體，故名律儀。」\n",
"a2_3X_51":"《瑜伽師地論》卷二二：「又戒律儀有三種觀清淨因\n相。何等爲三？一觀身業，二觀語業，三觀意業。云何觀察如是諸業，令戒律儀皆得清淨？\n謂希當造及欲正造，身作業時，如是觀察：我此身業，爲能自損，及以損他，是不善性，能\n生眾苦，招苦異熟？爲不自損，亦不損他，是其善性，能生諸樂，招樂異熟？如是觀已，若\n自了知，我此身業，自損損他，是不善性，能生眾苦，招苦異熟，即於此業，攝斂不作，亦\n不與便……。如於身業，於其語業當知亦爾。由過去行爲緣生意，由未來行爲緣生意，由現\n在行爲緣生意，即於此意，數數觀察：我此意業，爲能自損？餘如前說。如是觀已，若自了\n知，我此意業，是其黑品，即於此業，攝斂不起，不與其便；若自了知，我此意業，是其白\n品，即於此業，而不斂攝，發起與便。如是於彼去來今世所起意業，能善觀察，能善清淨。\n所以者何？去來今世所有沙門，若婆羅門，於身語意三種業中，或已觀察，或當觀察，或正\n觀察；或已清淨，或當清淨，或正清淨；或已多住，或當多住，或正多住，一切皆由如是觀\n察，如是清淨。」\n",
"a2_3X_52":"《瑜伽師地論》卷二二：「復於過去已造身業，亦數\n觀察：我此身業爲能自損？餘如前說。如是觀已，若自了知我此身業自損損他，餘如前說，\n便於有智同梵行所，如實發露，如法悔除。」\n",
"a2_3X_53":"《瑜伽師地論》卷二二：「如佛世尊曾爲長老囉怙囉\n說：汝今囉怙囉，於身語意業，應數正觀察，念諸佛聖教。囉怙囉汝應，學是沙門業，若能\n於此學，唯勝善無惡。 若於如是身語意業審正思擇，諸此諸業爲能自損？廣說如前。是名\n觀察。若於一分攝斂不作，亦不與便，廣說乃至發露悔除；復於一分而不斂攝，造作與便，\n廣說乃至便生歡喜，晝夜安住，多隨修學，是名清淨。」\n",
"a2_3X_54":"《俱舍論》卷二四：「諸無漏道，是沙門性，懷此道\n者，名曰沙門，以能勤勞、息煩惱故。」\n",
"a2_3X_55":"四諦十六行相：觀四諦一諦各有四種之行相，合爲十六行相。\n　　　　　　　　　　　┌苦：　觀此身是苦\n　　　　　　　　　　　│空：　觀因緣所生故空。\n　　　　　　┌苦　諦─┤無常：觀因緣假成，故生滅無常。\n　　　　　　│　　　　└無我：觀因緣假成，故無我體。\n　　　　　　│　　　　┌集：　觀招集苦果。\n　　　　四　│　　　　│因：　觀苦果之因。\n　　　　諦　│集　諦─┤生：　觀苦果生，相繼存在。\n　　　　十　│　　　　└緣：　觀諸緣成就苦果。\n　　　　六─┤　　　　┌滅：　觀諸漏已盡，生死斷滅。\n　　　　行　│　　　　│靜：　觀三毒皆無，此心不亂，有明照作用，故靜。\n　　　　相　│滅　諦─┤妙：　觀出離三界，無諸憂患，故妙。\n　　　　　　│　　　　└離：　觀一切災害，皆已遠離。\n　　　　　　│　　　　┌道：　觀八正道，可至涅槃。\n　　　　　　│　　　　│如：　道契正理，故如。\n　　　　　　└道　諦─┤行：　由此萬行，以趣涅槃。\n　　　　　　　　　　　└出：　由此聖道，以出生死。\n",
"a2_3X_56":"《佛說無量壽經》卷下：「佛告阿難：十方世界諸天\n人民，其有至心願生彼國，凡有三輩。其上輩者，捨家棄欲，而作沙門，發菩提心，一向專\n念無量壽佛，修諸功德，願生彼國。此等眾生，臨壽終時，無量壽佛與諸大眾，現其人前，\n即隨彼佛往生其國，便於七寶華中自然化生，住不退轉，智慧勇猛，神通自在。是故阿難，\n其有眾生，欲於今世見無量壽佛，應發無上菩提之心，修行功德，願生彼國。\n　　佛告阿難：其中輩者，十方世界諸天人民，其有至心願生彼國，雖不能行作沙門，大修\n功德，當發無上菩提之心，一向專念無量壽佛，多少修善，奉持齋戒，起立塔像，飯食沙門\n，懸繒然燈，散華燒香。以此迴向，願生彼國。其人臨終，無量壽佛化現其身，光明相好，\n具如真佛，與諸大眾現其人前，即隨化佛，往生其國，住不退轉，功德智慧次如上輩者也。」\n",
"a2_3X_57":"《瑜伽師地論》卷二五：「云何名爲但一坐食？謂坐\n一座，乃至應食，悉皆受食；從此座起，必不重食。如是名爲但一坐食。云何名爲先止後食\n？謂爲食故，坐如應座，乃至未食，先應具受諸所應食。應正了知：我今唯受爾所飲食，當\n自支持；又正了知：我過於此，定不當食。如是受已，然後方食。如是名爲先止後食。」\n",
"a2_3X_58":"《俱舍論頌疏》卷二○：「論云：諸煩惱起，由幾因\n緣？頌曰：由未斷隨眠，及隨應境現，非理作意起，說惑具因緣。釋曰：由三因緣，煩惱現\n起。一由未斷隨眠，即惑因也。二隨應境現。隨應者，隨其所應也，如順境生貪，違境生瞋\n等。此惑境界也。三由非理作意，即起惑加行也。由上三因，煩惱現起。說惑具因緣者，此\n上三因，謂此且據具因緣，說或有唯託境界力生，如退法阿羅漢等。」\n",
"a2_3X_59":"《瑜伽師地論》卷二五：「云何名爲沙門莊嚴？嗢拕\n南曰：　正信而無諂　　少病精進慧　　具少欲喜足　　易養及易滿　　杜多德端嚴　　知\n量善士法　　具聰慧者相　　忍柔和賢善\n　　謂如有一具足正信，無有諂曲，少諸疾病，性勤精進，成就妙慧，少欲喜足，易養易滿\n，具足成就杜多功德，端嚴知量，具足成就賢善士法，具足成就聰慧者相，堪忍柔和，爲性賢善。」\n",
"a2_3X_60":"《瑜伽師地論》卷二五：「云何名爲具足正信？謂多\n淨信，多正敬順，多生勝解，多善欲樂，於諸善法及大師所，深生淨信，無惑無疑。於大師\n所，恭敬尊重，承奉供養。既修如是恭敬尊重、承奉供養，專心親附、依止而住。如於大師\n，如是於法同梵行者，於諸所學教授教誡，於修供養，於無放逸，於三摩地，當知亦爾。如\n是名爲具足正信。」\n",
"a2_3X_61":"《瑜伽師地論》卷二五：「云何名爲無有諂曲？謂有\n純質，爲性正直，於其大師及諸有智同梵行所，如實自顯。如是名爲無有諂曲。」\n",
"a2_3X_62":"《瑜伽師地論》卷二三：「云何名爲爲令新受當不更\n生受諸飲食？謂如有一由現在世，安樂無病，氣力具足，不非量食，不食匪宜，亦非不消，\n而更重食，令於未來，食住身中，成不消病；或於身中當生隨一身諸疾病，所謂疥癩、皰漿\n瘶等，如前廣說，由是因緣，當生身中如前所說種種苦受。餘如前說。如是名爲爲令新受當\n不更生受諸飲食。」\n",
"a2_3X_63":"《瑜伽師地論》卷二五：「云何名爲少諸疾病？謂性\n無病，順時變熟，平等執受，不極溫熱，不極寒冷，無所損害，隨時安樂，由是因緣，所食\n所飲，所噉所甞，易正變熟。如是名爲少諸疾病。」\n",
"a2_3X_64":"《瑜伽師地論》卷二五：「云何名爲性勤精進。謂能\n安住有勢。有勤有勇堅猛。於善法中能不捨軛。翹勤無惰起發圓滿。能有所作。於諸有智同\n梵行者躬自承奉。如是名爲性勤精進。」\n",
"a2_3X_65":"《俱舍論頌疏》卷第十六，唐圓暉述。\n",
"a2_3X_66":"《瑜伽師地論》卷二五：「云何名爲成就妙慧？謂聰\n、念、覺皆悉圓滿，根不闇鈍，根不頑愚，亦不瘖瘂，非手代言，有力能了善說惡說所有法\n義，具足成就俱生覺慧，具足成就加行覺慧。如是名爲成就妙慧。」\n",
"a2_3X_67":"《瑜伽師地論》卷八五：「又由五相發勤精進速證通\n慧。謂有勢力者，由被甲精進故；有精進者，由加行精進故；有勇捍者，由於廣大法中無怯\n劣精進故；有堅猛者，由寒熱蚊虻等所不能動精進故；有不捨善軛者，由於下劣無喜足精進故。」\n",
"a2_3X_68":"《瑜伽師地論》卷二五：「云何少欲？謂雖成就善少\n欲等所有功德，而不於此欲求他知，謂他知我具足少欲成就功德。是名少欲。」\n",
"a2_3X_69":"《瑜伽師地論》卷二五：「云何喜足？謂於隨一衣服\n飲食臥具等事，便生歡喜，生正知足。於所未得，所有衣服，或麁或妙，更無悕望，更無思\n慮；於所已得，不染不愛，如前廣說，而受用之。如於衣服，於其飲食、臥具等事，當知亦\n爾。是名喜足。」\n",
"a2_3X_70":"《瑜伽師地論》卷二五：「云何易養？謂能獨一自得\n怡養，不待於他，或諸僮僕，或餘人眾；又不追求餘長財寶，令他施者、施主等類謂爲難養\n。是名易養。」\n",
"a2_3X_71":"《瑜伽師地論》卷二五：「云何易滿？謂得微少，便\n自支持；若得麁弊，亦自支持。是名易滿。」\n",
"a2_3X_72":"《瑜伽師地論》卷二五：「云何成就杜多功德？謂常\n期乞食，次第乞食，但一坐食，先止後食，但持三衣，但持毳衣，持糞掃衣，住阿練若，常\n居樹下，常居逈露，常住塚間，常期端坐，處如常坐。如是依止若食若衣、若諸敷具杜多功\n德，或十二種，或十三種。於乞食中，分爲二種。一者隨得乞食，二者次第乞食。隨得乞食\n者，謂隨往還家，隨獲隨得，而便受食。次第乞食者，謂入里巷，巡家而乞，隨得隨現，而\n便受食。不高舉手越趣餘家，願我當獲精妙飲食，乃至期願多有所得。當知此中，若依乞食\n無差別性，唯有十二；若依乞食有差別性，便有十三。云何名爲但一坐食？謂坐一座，乃至\n應食，悉皆受食；從此座起，必不重食。如是名爲但一坐食。云何名爲先止後食？謂爲食故\n，坐如應座，乃至未食，先應具受諸所應食，應正了知，我今唯受爾所飲食，當自支持；又\n正了知，我過於此，定不當食。如是受已，然後方食。如是名爲先止後食。云何名爲但持三\n衣？謂但三衣，而自支持。何者三衣？一僧伽胝，二嗢怛囉僧伽，三安怛婆參。除此三衣，\n終不貯畜過此長衣。如是名爲但持三衣。云何名爲但持毳衣？謂所持衣，或三衣數，或是長\n衣，一切皆用毛毳而作，終不貯畜餘所作衣。如是名爲但持毳衣。云何名爲持糞掃衣？謂所\n有衣，他捨、棄擲，或街或巷，或市或鄽，或道非道，或雜便穢，或爲便穢膿血洟唾之所塗\n染，取如是等不淨衣物，除去麁穢，堅執洗浣，縫染受持。如是名爲持糞掃衣。云何名爲住\n阿練若？謂住空閑山林坰野，受用邊際，所有臥具，遠離一切村邑聚落。如是名爲住阿練若\n。云何名爲常居樹下？謂常期願住於樹下，依止樹根。如是名爲常居樹下。云何名爲常居逈\n露？謂常期願住於逈露，無覆障處。如是名爲常居逈露。云何名爲常住塚間？謂常期願住塚\n墓間，諸有命過，送尸骸處。如是名爲常住塚間。云何名爲常期端坐？謂於大床，或小繩床\n，或草葉座，端身而坐，推度時日，終不以背，或以其脇，依倚大床，或小繩床，或壁或樹\n，草葉座等。如是名爲常期端坐。云何名爲處如常座？謂所坐臥，或諸草座，或諸葉座，如\n舊敷設草座葉座，而常坐臥，一敷設後，終不數數翻舉修理。如是名爲處如常座。」\n",
"a2_3X_73":"《瑜伽師地論》卷二五：「云何端嚴？謂能成就若往\n若還，若覩若瞻，若屈若伸，持僧伽胝，持衣持鉢，端嚴形相。是名端嚴。」\n",
"a2_3X_74":"《瑜伽師地論》卷二五：「云何知量？謂於淨信，諸\n婆羅門，長者居士，極恣衣服、飲食敷具、病緣醫藥諸什物中，知量而聚。是名知量。」\n",
"a2_3X_75":"《瑜伽師地論》卷二五：「云何成就賢善士法？謂生\n高族，淨信出家，或生富族，淨信出家，顏容殊妙，喜見端嚴，具足多聞，語具圓滿，或隨\n獲得少智、少見、少安樂住，由是因緣，不自高舉，不陵蔑他，能知唯有法隨法行，是其諦\n實。既了知已，精進修行法隨法行。是名成就賢善士法。」\n",
"a2_3X_76":"《瑜伽師地論》卷二五：「云何成就總慧者相？謂由\n作業相表知愚夫，由作業相表知聰慧。其事云何？謂諸愚夫，惡思所思，惡說所說，惡作所\n作；諸聰慧者，善思所思，善說所說，善作所作。是名成就聰慧者相。」\n",
"a2_3X_77":"《瑜伽師地論》卷二五：「云何堪忍？謂如有一罵不\n報罵、瞋不報瞋、打不報打、弄不報弄，又彼尊者堪能忍受寒熱飢渴、蚊虻風日、蛇蠍毒觸\n，又能忍受他所干犯麁惡語言，又能忍受身中所有猛利堅勁辛楚切心奪命苦受，爲性堪忍，\n有所容受。是名堪忍。」\n",
"a2_3X_78":"《瑜伽師地論》卷二五：「云何柔和？謂如有一於大\n師等，具足成就慈愍身業，具足成就慈愍語業，具足成就慈愍意業，與諸有智同梵行者，和\n同受用，應所受用，凡所飲食，無有私密，如法所獲，如法所得，墮在鉢中，爲鉢所攝，而\n爲受用，同戒同見，成就如是六種可樂可愛可重，無違諍法，易可共住，性不惱他；與諸有\n智同梵行者共住一處，常令歡喜。是名柔和。」\n",
"a2_3X_79":"《瑜伽師地論》卷九九：「又由二相，成可樂性：一\n體彼有德而尊重故，二荷彼有恩而慰意故。又可樂性，有二差別：一者未生令其得生，二者\n生已當倍增廣。應知此中，尊重增上，謂體彼有德；慰意增上，謂財法二攝。彼二增上，謂\n善和合。和合增上，謂心無擾惱。遠離貪等所有擾惱，名曰無違。和合方便，共爲一事，名\n曰無諍。和同水乳，名一趣性。」\n",
"a2_3X_80":"《瑜伽師地論》卷二五：「云何賢善？謂如有一遠離\n頻蹙，舒顏平視，含笑先言，常爲愛語，性多攝受善法朋侶，身心澄淨。是名賢善。」\n",
"a2_3X_81":"《俱舍論頌疏》第二十九卷：“正法有二。一教二證。教\n謂契經。調伏對法。證謂三乘菩提分法。有能受持及正說者。教法住世。有能依教正修行者\n。佛正證法。便住世間。道藉人弘。法依人住。人在法在。人亡法亡。故世親云。故隨三人\n住世時量。應知正法。住爾所時。”\n",
"a2_3X_82":"小乘見道以前之修行位也。總稱見道以前爲賢位，見道以後\n爲聖位。賢位中有七位：一、五停心觀，二、別相念住，三、總相念住，謂之三賢位，四、\n煖法，五、頂法，六、忍法，七、世第一法，謂之四善根。\n",
"a2_3X_83":"慧解脫：謂以智慧斷除無明惑業之縛，而得解脫，故名慧解脫。\n",
"a2_3X_84":"簡別：簡擇差別之意。又曰簡異，別異，分異，略曰簡。謂\n簡擇諸法之同異，而明其差別也。\n",
"a2_3X_85":"《大學》：誠於中，形於外，故君子必慎其獨也。\n",
"a2_3X_86":"《攝大乘論世親釋》：“以他心智了知彼心，無餘方便能\n轉彼業。如實了知彼由此業定退善趣定往惡趣。如是知已生如是心。我作此業當墮惡趣，我\n寧自往必當脫彼。”\n",
"a2_3X_87":"《俱舍論頌疏》：“爲開智者慧毒門，如身少破，著少毒\n藥，須臾毒氣，遍滿身中。此論亦然，開少慧門，諸有智人，能深悟入，如似毒門，名慧毒\n門。聰明論名，因茲起也。”\n",
"a2_3X_88":"九住心：《瑜伽師地論》卷三十（一二六一頁）：“云何名\n為九種心住，謂有比丘，令心內住、等住、安住、近住、調順、寂靜、最極寂靜、專注一趣\n、及少等持。如是名為九種心住。”\n",
"a2_3X_89":"《瑜伽師地論》三十七卷：諸佛菩薩，略有三種神變威力。\n一者、神境神變所攝。二者、記說神變所攝。三者、教誡神變所攝。當知此三，如其所應，\n攝入三種神通威力。謂神境智通威力，心差別智通威力，漏盡智通威力。\n",
"a2_3X_90":"《瑜伽師地論》四十卷：“謂九種相戒，名爲菩薩戒\n波羅蜜多。一、自性戒。二、一切戒。三、難行戒。四、一切門戒。五、善士戒。六、一切\n種戒。七、遂求戒。八、此世他世樂戒。九、清淨戒。”如彼卷至四十二卷五頁廣釋。\n",
"a2_3X_91":"能海上師譯本：“無方距果遙，果近善方便”。法尊法\n師譯本：“非方便則遠，方便即非遙”。\n",
"a3_kosa_1":"見《大唐大慈恩寺三藏法師傳》。\n",
"a3_kosa_2":"婆娑：正譯「婆沙」，即《阿毗達磨大毗婆沙論》之略稱，\n亦作《大毗婆沙》。\n",
"a3_kosa_3":"見歐陽竟無《阿毗達磨俱舍論敘》。\n",
"a3_kosa_4":"昆勒：又作蜫勒，論藏名。《大智度論》卷十八：「智者入\n三種法門，觀一切佛語，皆是實法，不相违背。何等是三門？一者蜫勒門，二者阿毗曇門，\n三者空門。問曰：云何名蜫勒？（中略）答曰：蜫勒有三百二十萬言，佛在世時，大迦旃延\n之所造。佛滅度後，人壽轉減，憶識力少，不能廣誦，諸得道人撰爲三十八萬四千言。若人\n入蜫勒門，論議則無窮。其中有隨相門、對治門等種種諸門。」\n",
"a3_kosa_5":"《瑜伽師地論》卷二八：「所趣義故，最勝義故，名爲增上\n。云何所趣義？謂爲趣增上心而修淨戒，名增上戒學；爲趣增上慧而修定心，名增上心學；\n爲趣煩惱斷而修智見，名增上慧學……云何最勝義？謂若增上戒學，若增上心學，若增上慧\n學，唯於聖教，獨有此三，不共外道，如是名爲最勝義故，名爲增上。」\n",
"a3_kosa_6":"《麟記》卷一：「論道：指能詮教也，以言論道理成於教故\n，而令衆生得此之教，得論道言。」\n",
"a3_kosa_7":"《金剛經》：「須菩提！若菩薩心住於法而行布施，如人入\n闇，則無所見。若菩薩心不住法而行布施，如人有目，日光明照，見種種色。」\n",
"a3_kosa_8":"《大唐大慈恩寺三藏法師傳》卷一：「俄而有敕，於洛陽度\n二七僧。時業優者數百，法師以幼少不預取限，立於公門之側。時使人大理卿鄭善果有知士\n之鑒，見而奇之。問曰：子爲誰家？答以氏族。又問曰：求度耶？答曰：然，但以習近業微\n，不蒙比預。又問：出家意何所爲？答曰：意欲遠紹如來，近光遺法。果深嘉其志，又賢其\n器貌，故特而取之。因謂官僚曰：誦業易成，風骨難得。若度此子，必爲釋門偉器。但恐果\n與諸公不見其翔翥雲霄，灑演甘露耳。」\n",
"a3_kosa_9":"《暉鈔》卷一：「得白玉於青山者，藍田人卞和，少有賢德\n故，政於荆山，得璧玉方尺，三獻楚，初昭王，次荆王，後平王，第三獻納之。方唐三藏得\n論以裎先德。」\n",
"a3_kosa_10":"窺基大師《百法明門論解》：「大乘者是能詮教，唯聲\n名句文四法故劣；百法乃所詮事理，通一百法故勝。將勝就劣，以劣顯勝，云大乘之百法，\n依士釋也。又百法是所緣，乃舉全數故勝；明是能緣之慧，即别境五中之一法耳故劣。將劣\n就勝，以勝顯劣，云百法之明，依主釋也。」\n",
"a3_kosa_11":"《光記》卷一：「初説諸言，顯無朋黨，以德召人，諸\n有三德，我即歸敬。以諸外道，各謂其師，是一切智，若偏歸敬釋迦牟尼，恐彼生謗，故置\n諸言，息其異論。」\n",
"a3_kosa_12":"《光記》卷一：「何故論初，讚德歸敬？解云：恐有魔\n事，造論不終，讚德歸敬，請加被故。故顯宗云：以讚禮言，滅諸惡障，標嘉瑞故。又解：\n爲知世尊，有勝功德，於佛説法，生信尊重。又解：猶如孝子，凡有所作，皆啟父母，論主\n亦爾，今欲造論，先啟世尊。」\n",
"a3_kosa_13":"見《大智度論》卷八十四。\n",
"a3_kosa_14":"《光記》卷一：「不染無知，以未成佛來，所有一切有\n漏無染劣慧爲體。故正理二十八云：是故即於味、勢、熟等不懃求解慧，與異相法俱爲因，\n引生彼同類慧。此慧於解又不懃求，復爲因引生不懃求解慧。如是展轉無始時來，因果相仍\n習以成性，故即於彼味等境中，數習於解無堪能智。此所引劣智名不染無知。即此俱生心心\n所法總名習氣，理定應然。或諸有情有煩惱位，所有無染心及相續，由諸煩惱間雜所熏，有\n能順生煩惱氣分。故諸無染心及眷屬，似彼行相差别而生。由數習力相繼而起故，離過身中\n，仍名有習氣。」\n",
"a3_kosa_15":"《寶疏》卷一：「問：此邪智是何？答：此是欲界修所\n斷中，無覆無記邪行相智。如於杌起人想，及於人起杌想，於非道起道想，於道起非道想，如是等。」\n",
"a3_kosa_16":"見《俱舍論頌講記》（上）第五五頁。\n",
"a3_kosa_17":"《現證莊嚴論顯明義疏》：「聖慈氏説，堅穩之自行，\n及隨順熾然利他之教者，謂由各各自明之慧，依止般若波羅蜜多經，所有至極之教，是將來\n能得一切妙善主要之因也。」（見《能海上師全集》第五輯第二五頁）\n",
"a3_kosa_18":"《光記》卷一：「此論亦敬佛寶，於智德中，兼顯佛故\n……此論亦敬法寶，涅槃果法，即斷德故……此論亦敬僧寶，於恩德中，兼顯僧故……拔衆\n生令出三界，即顯僧寶。」\n",
"a3_kosa_19":"《大乘本生心地觀經》卷二：「一切如來爲化十地諸菩\n薩衆，現於十種他受用身。第一佛身，坐百葉蓮華，爲初地菩薩説百法明門，菩薩悟已起大\n神通，變化滿於百佛世界，利益安樂無數衆生。第二佛身，坐千葉蓮華，爲二地菩薩説千法\n明門，菩薩悟已起大神通，變化滿於千佛世界，利益安樂無量衆生。第三佛身，坐萬葉蓮華\n，爲三地菩薩説萬法明門，菩薩悟已起大神通，變化滿於萬佛國土，利益安樂無數衆生。如\n是如來漸漸增長，乃至十地他受用身，坐不可説妙寶蓮華，爲十地菩薩説不可説諸法明門，\n菩薩悟已起大神通，變化滿於不可説佛微妙國土，利益安樂不可宣説不可宣説無量無邊種類衆生。」\n",
"a3_kosa_20":"《稽古》：「姚秦竺佛念譯出曜經千章法句，宋天息災\n譯法集要頌經是也。」\n",
"a3_kosa_21":"見《頌疏集註》第五三頁。\n",
"a3_kosa_22":"《順正理論》卷四九：「如何隨眠於相應法，及所緣境\n有隨增義？先軌範師作如是説，如城邑側有雜穢聚，糞水土等所共合成，於此聚中由糞過失\n，令水土等亦成不淨，由水等力令糞轉增，更互相依皆甚可惡。如是煩惱相應聚中，由煩惱\n力染心心所，煩惱由彼勢力轉增，更互相依皆成穢污，此聚相續穢污漸增，亦令隨行生等成\n染。如猪犬等居雜穢聚，生極耽樂眠戲其中，糞穢所塗轉增不淨，復由猪等穢聚漸增。如是\n所緣自地有漏，由煩惱力有漏義成，彼復有能順煩惱力，令其三品相次漸增。」\n",
"a3_kosa_23":"《俱舍論頌疏》卷四：「心、心所五義平等，故説相應\n：一所依、二所緣、三行相、四時、五事。」\n",
"a3_kosa_24":"此標題在《頌疏》原文中無，係編者所加。\n",
"a3_kosa_25":"《八識規矩纂釋》卷一：「浮塵根眼如蒲桃朵，耳如新\n卷葉，鼻如雙垂瓜，舌如初偃月，身如腰鼓顙是也。」\n",
"a3_kosa_26":"《俱舍論頌疏》卷七：「四大種望所造色，能爲五因：\n一生，二依，三立，四持，五養。此之五因，於前六因，能作因摄。此四大種，生所造色，\n名為生因，造色生已，隨逐大種，如依師等，説爲依因；大種任持所造色故，如壁持畫，説\n爲立因；令所造色相續不斷，説爲持因；增長因故，説爲養因。」\n",
"a3_kosa_27":"《俱舍論頌疏》卷一：「言正釋品名者，族義、持義、性義名界。」\n",
"a3_kosa_28":"眼等五識，依眼等時：《大正藏》本作「眼識等五，依眼等根」。\n",
"a3_kosa_29":"《俱舍論頌疏》卷七：「心心所由四者，謂心心所，由\n四緣生。此中因緣，謂五因性。等無間緣者，謂心、心所，必須前念等無間緣，引發生故。\n所緣緣者，緣境起故。增上緣者，除自性外，餘一切法，皆不障故。」\n",
"a3_kosa_30":"《俱舍論頌疏》卷十三：「第一説三色證者，以契經説\n色有三種，此三爲處，攝一切色。一者有色有見有對（色處是也），二者有色無見有對（眼\n等五根，聲香味觸），三者有色無見無對（無表色也）。此經既説有無見無對色，明知實有無表也。」\n",
"a3_kosa_31":"《俱舍論頌疏》卷十三：「第五法處色證者，又契經説\n，苾芻當知，法謂外處，是十一處所不攝法，無見無對。\n此經於法處中，不言無色，故知法處中，實有無表色，若無無表色，此經闕減，便成無用，\n謂經闕減無色言故，既不言無色，明知實有無表。」\n",
"a3_kosa_32":"《大毗婆沙論》卷十三：「問：何故眼耳鼻各有二處，\n而舌身唯有一耶？答：諸色根處為壯嚴身。若有二舌是鄙陃事，世便嗤笑，云何此人而有二\n舌，如似毒蛇。若有二身亦是鄙陃，世所嗤笑，云何一人而有二身，如兩指并。問：眼耳鼻\n處何故唯二不增不減？脅尊者言，一切生疑故不應責，謂若增減亦復生疑，云何此三各唯爾\n所，然各二處不違法性。有說，根處為壯嚴身，若減若增身便醜陋。有說，色根為生凈識，\n若當三識依二處生則明不亂，增便識亂，減則不明。有說，色根為取自境各唯有二，取境事\n足。減則不明，增便無用。」\n",
"a3_kosa_33":"《順正理論》卷三：「若爾何故，説眼等根爲令端嚴各\n生二處？此有别義，非爲嚴身。現見世間，於諸作用增上圓滿，亦説端嚴。若眼等根各闕一\n處，見聞嗅用皆不明了，各具二者明了用生。是故此言爲端嚴者，正是爲令用增上義。」\n",
"a3_kosa_34":"《光記》卷一：「一身謂一有情身，一相續謂一期相續\n。或一身謂一期身，一相續謂一有情相續。」\n",
"a3_kosa_35":"《俱舍論》卷二：「云何眼等諸根極微安布差别？眼根\n極微在眼星上傍布而住，如香荾花，清澈映覆，令無分散。有説，重累如丸而住，體清澈故\n，如頗胝迦不相障礙。耳根極微居耳穴内旋環而住，如卷樺皮。鼻根極微居鼻頞内背上面下\n，如雙爪甲。此初三根横作行度處無高下，如冠花鬘。」\n",
"a3_kosa_36":"《中阿含經》卷四十：「梵志即復問曰：瞿曇，空何所\n依住？世尊答曰：空無所依，但因日月，故有虚空。」\n",
"a3_kosa_37":"《俱舍论》卷二：「或複礙者是和會義。」\n",
"a3_kosa_38":"《法義》卷二：「今皞按，神太爲正。一、此本出法勝\n毗曇，彼一説三種有對訖云，如上座鳩摩羅多説，若心欲起時，爲他所障礙，當知是障礙有\n對，相違是無對，彼已不破故。今云此是所許，有部不悉許經部義，而於此事若遇異緣可起\n，心不起爲障礙有對，是亦有理，有部不敢諍，故簡别云：此是所許。若如光寶，何彼論不\n破耶？二、若朋經部，何故不言，毗婆沙師傳説如是，此中大德等。三、若違有部，正理論\n師何不破立？謂雖是非有部尊義，而亦無害，故彼不舉。」\n",
"a3_kosa_39":"《泰疏》卷二：「此中大德下，引大德説，證有對無對\n義。鳩摩羅多，此云童子，是經部師。彼大德説，如人目覩南壁北時，是南壁南處心欲生，\n他南壁北礙令不起，應知是有對，無對此相違。雖是經部説，不違薩婆多義，故云此是所許也。」\n",
"a3_kosa_40":"《大毗婆沙》卷五一：「問：何故名善、不善、無記？\n答：若法巧便所持，能招愛果，性安隱故名善。巧便所持者顯道諦。能招愛果者，顯苦集諦\n少分，即有漏善。性安隱者顯滅諦。若法非巧便所持，能招不愛果，性不安隱故名不善。此\n總顯苦集諦少分，即諸惡法。若法與彼二種相違，故名無記。復次，若法能招可愛果樂受果\n，故名善。若法能招不愛果苦受果，故名不善。若法與彼二種相違，故名無記。復次，若法\n能引可愛有芽及解脱芽，故名善。若法能引非愛有芽，故名不善。若法與彼二種相違故名無\n記。復次，若法能令生善趣，故名善。若法能令生惡趣，故名不善。若法與彼二種相違，故\n名無記。復次，若法墮還滅品，性輕昇故名善。若法墮流轉品，性沈重故名不善。若法與彼\n二種相違，故名無記。」\n",
"a3_kosa_41":"《法藴足論》卷七：「尋與伺，何差别？令心粗性是尋\n，令心細性是伺。此復如何？如打鍾時，粗聲暫發，細聲隨轉。粗聲喻尋，細聲喻伺。」\n",
"a3_kosa_42":"《順正理論》卷四：「頌中及言，具含二義：一顯總集\n，謂八及聲總無執受。二顯異門，謂餘師説，不離根聲亦有執受。」\n",
"a3_kosa_43":"《俱舍論》卷二：「身等色根不名所斫，非可全斷令成\n二故。非身根等可成二分，支分離身則無根故。又身根等亦非能斫，以淨妙故如珠寶光。」\n",
"a3_kosa_44":"《光記》卷二：「問：地獄碎身，或斷蛇等，令成多分\n，分各别行，是即支分離身有根？解云：地獄現相見成多分，理實諸分皆有身根。斷蛇等身\n有餘勢動。故婆沙九十云：有餘師説，諸地獄中，雖解支節爲百千分，而諸分内皆有身根，\n諸分中間有連續故。如碎杜仲及藕根莖，亦如破苽蔕不相離。若相離者身根即無。非一有情\n有二身故。而世現見斷諸蟲身，爲多分已猶行動者，風勢所轉非有身根。問：有斷蛇等各别\n生者，此云何釋？解云：是餘有情依託生故。」\n",
"a3_kosa_45":"《基本三學》：「異時而熟：因果不同時，非如刀砍傷\n，有生報後報，要待緣而熟。異類而熟：人作善惡業，天獄等受報，或因口作業，受報在身\n等，又手足作業，而餘處受報，勿謂報有差，報主不變易。變易而熟：木水盡成炭，炭無火\n成灰，舊種壞，新種生，果縛斷，子縛生，報有生後，果須變易。」\n",
"a3_kosa_46":"《順正理論》卷七：「有餘部説，處隔越故，眼見色時\n唯一非二。又以一眼觀箭等時，能審定知曲直相故。速疾轉故，增上慢心，謂我一時二眼能見。」\n",
"a3_kosa_47":"《俱舍論》卷三十：「昔有大德，名曰龍軍，三明六通\n，具八解脫。於時有一畢鄰陀王，至大德所，作如是說：我今来意，欲請所疑，然諸沙門性\n好多語，尊能直答，我當請問。大德受請。王即問言：命者與身為一為異？大德答言：此不\n應記。王言：豈不先有要耶，今何異言不答所問？大德質曰：我欲問疑，然諸國王性好多語\n，王能直答，我當發問。王便受教。大德問言：大王宮中，諸菴羅樹所生果味，為酢為甘？\n王言：宮中本無此樹，大德復責：先無要耶，今何異言不答所問？王言：宮內此樹既無，寧\n可答言果味甘酢？大德誨曰：命者亦無，如何可言與身一異？」\n",
"a3_kosa_48":"《光記》卷二：「識見家難，即是法救，大衆部等。」\n",
"a3_kosa_49":"《俱舍論》卷三：有餘師（識見家）説：能導養身，非眼\n等用，是識增上，識了方能避於險難。受段食故，見色等用亦非異識，故不共事於眼等根，\n不可立爲别增上用，故非由此眼等成根。」\n",
"a3_kosa_50":"詳見《大毗婆沙》卷一四二－一四三。\n",
"a3_kosa_51":"無界界：疑爲「無色界」。\n",
"a3_kosa_52":"除此三淨：疑爲「除此三根」。\n",
"a3_kosa_53":"《大毗婆沙》卷一三一：「問：云何得知此四大種恒不相\n離？答：自相作業，一切聚中，皆可得故。謂堅聚中，地界自相，現可得故，有義極成。於\n此聚中，若無水界，金銀錫等應不可銷。又水若無，彼應分散。若無火界，石等相擊，火不\n應生。又火若無，無能成熟，彼應腐敗。若無風界，應無動摇。又若無風，應無增長。於濕\n聚中，水界自相，現可得故，有義極成。於此聚中，若無地界，至嚴寒位，應不成氷。又地\n若無，船等應没。若無火界，應無煖時。又火若無，彼應腐敗。若無風界，應不動摇。又風\n若無，應無增長。於煖聚中，火界自相，現可得故，有義極成。於此聚中，若無地界，燈燭\n等焰，應不可迴。又地若無，不應持物。若無水界，應不生流。又水若無，焰不應聚。若無\n風界，應不動摇。又若無風，應無增長。於動聚中，風界自相，現可得故，有義極成。於此\n聚中，若無地界，觸牆等障，應不折迴。又地若無，應不持物。若無水界，應無冷風。又水\n若無，彼應分散。若無火界，應無煖風。又火若無，彼應腐敗。問：此四大種，其相各異，\n展轉相違，云何一時不相離起？尊者世友作如是説：言異相相違，因緣各别，非諸相異，皆\n必相違。諸不相違，而相異者，容俱時起，互不相離，如四大種及香味觸青黄色等。諸有異\n相而互相違，必無一時，不相離起，如薪與火，雹與稼穡，邏呼月輪，藥病明闇。」\n",
"a3_kosa_54":"《大毗婆沙》卷九十：「生欲色界有情身中，多四大種在\n一身内，有相擊者便發生聲。」\n",
"a3_kosa_55":"《俱舍論》卷二一：「嫉謂於他諸興盛事，令心不喜。慳\n謂財法巧施相違，令心吝著。於情非情令心憤發，説名爲忿。隱藏自罪説名爲覆。」「惱謂\n堅執諸有罪事，由此不取如理諫悔。害謂於他能爲逼迫，由此能行打駡等事。恨謂於忿所緣\n事中，數數尋思結怨不捨。諂謂心曲，由此不能如實自顯。或矯非撥，或設方便，令解不明\n。誑謂惑他。憍前已釋。」\n",
"a3_kosa_56":"《麟記》卷二一：「正理云：恨與忿相，有差别者，如樺\n皮火，其根猛利，而餘勢弱，説名爲忿；如冬室熱，其相雖微，而餘勢强，説名爲恨。由此\n故有説恨相，言忿息已續生，令心濁，名恨。」\n",
"a3_kosa_57":"《俱舍論》卷七：「欲界無覆，分爲四心：一、異熟\n生，二、威儀路，三、工巧處，四、通果心。」\n",
"a3_kosa_58":"《四十二章經》：「有沙門夜誦經甚悲，意有悔疑，\n欲生思歸。佛呼沙門問之：汝處於家將何修爲？對曰：恒彈琴。佛言：絃緩何如？曰：不鳴\n矣。絃急何如？曰：聲絶矣。急緩得中何如？曰：諸音普矣。佛告沙門：學道猶然，執心調\n適，道可得矣。」\n",
"a3_kosa_59":"於所所造罪：疑衍一「所」字。\n",
"a3_kosa_60":"《俱舍論》卷四：「復有釋言：尋伺二法，是語言行\n。故契經言：要有尋伺，方有語言，非無尋伺。此語言行，粗者名尋，細者名伺，於一心内\n，别法是粗，别法是細，於理何違。若有别體類，理實無違，然無别體類，故成違理，一體\n類中，無容上下俱時起故。若言體類亦有差别，應説體類别相云何。此二體類，别相難説，\n但由上下顯其别相，非由上下能顯别相，一一類中有上下故。由是應知，尋伺二法，定不可\n執一心相應。若爾，云何契經中説，於初靜慮，具足五支。具五支言，就一地説，非一刹那\n，故無有過。如是已説尋伺差别。」\n",
"a3_kosa_61":"《基本三學》：「恃我慢憍勝，無明顛倒始，煩惱諸\n行生，内慧行自照。初叚有十法，恃生恃種姓，恃色恃財福，恃貴恃尊勝，恃豪族無病，恃\n年壯命壯，皆屬生身執，不可依作依；次叚十二法，恃工巧多聞，辯才得利養，得恭敬尊重\n，恃備足師範，恃徒衆黨侣，恃長宿恃力，皆從我所生；後叚十六法，恃神足禪定，恃無求\n知足，獨處阿練若，恃乞食糞掃，離荒食一受，恃冢間露處，樹下常端坐，隨坐但三衣（增\n），如是十六法，皆三學杜多，佛讚勝功德，不恃則爲妙，内慧行之基。」\n",
"a3_kosa_62":"《麟記》卷四：「諸餘有情者，即前所除之外，苦法\n智位已去，及先離染苦忍聖人，兼餘一切斷惑異生，此等諸\n類皆成擇滅，名爲餘也。章中言餘有情謂一切聖人者，誤矣。」\n",
"a3_kosa_63":"謂未來情數：有本作「未來情數」。\n",
"a3_kosa_64":"《寶疏》卷四：「又婆沙釋無唯法後非得云：非無始\n來恒成就彼未捨必起彼類盡故。准此文意，所不得法，約法種類説有非得。有頂見惑種類衆\n多，已入過去，雖復但有法後非得，在未來者即有法前非得。然此文是被難之後重改婆沙，\n然此不順得中六句。應云：以不定故，容有二種非得。以非想地過去見道煩惱，於過去世中\n煩惱未起之前皆容入聖，若未起煩惱，即斷見惑，即此煩惱即有法前非得。由此説過去煩惱\n不得名爲唯法後非得。若作此釋，即順得中六句，即同自餘通二非得。由不得此意，被將過\n去見惑唯法後難應成四句通難不得，遂改婆沙以爲四句。見今長安多本流行，猶作四句，於\n後數年重改論文云唯有三句，遂加文遮難云非無始等一十六字通此妨難，由未得婆沙意故，由未盡理。」\n",
"a3_kosa_65":"《俱舍論》卷二七：「論曰：神境通果，能變化心力\n，能化生一切化事。此有十四，謂依根本四靜慮生有差别故。依初靜慮，有二化心，一欲界\n攝，二初靜慮。第二靜慮，有三化心，二種如前，加二靜慮。第三有四。第四有五。謂各自\n下，如理應思。諸果化心，依自上地，必無依下。下地定心，不生上果，勢力劣故。」\n",
"a3_kosa_66":"《發智論》卷二：「云何異生性？答：若於聖法聖煖\n聖見聖忍聖欲聖慧，諸非得已非得當非得，是謂異生性。」\n",
"a3_kosa_67":"《俱舍論頌疏》卷二三：「言正性者，所謂涅槃。見\n道能證，名為正性離生。正性之離生，依主釋也。或此見道，即名正性，聖正性故。正性即\n離生，持業釋也。又此見道，或名正性決定，謂決取涅槃故，或決了諦相，故名決定也。若\n正性是涅槃，即正性之決定。若正性目見道，正性即決定。二釋同前。苦法智忍名為入者，\n最初入故，故得入名……見所斷惑，令諸有情墮在惡趣受諸劇苦，猶如生食在有情身，作苦\n惱事，故名為生。或由見惑，令諸善根不能淳熟，故名為生。見道能越，故名離生。」\n",
"a3_kosa_68":"《現證莊嚴論文句頌解》七十義之四十三：「一、此\n三千大千世界之中，南嚴浮提之有情不惜財貨，特能於如來所，作特殊之供養。二、特於般\n若波羅蜜能作意念（印順接近）。三、能得無生法忍（一切法無生心能忍許）。四、於所應\n作之菩提及能作之諸法，能無所緣。五、於十善等（四靜慮）及無色之修習悟入易得。六、\n接近諸天鄰次之下。七、自能鎮伏諸魔勢力。八、與導師及相同之士夫共在一處（有與佛血統關係）。」\n「復次：一、一切種種善巧方便學處完全清淨（别解脱戒能全受，受已清淨護持）。二、具\n足成就如來種性（利他）。三、能得佛果之因相具足（悲心、菩薩行）。四、於波羅蜜反背\n方面心意不生。五、於色等及俱有，具足之觀念心非熾然生（於五塵境不深染著）。六、普\n攝廣大波羅蜜能正知（《大般若》全部教理能知）。七、一切圓滿成就能得（依教修行能得\n大般若）。八、正等圓滿菩提相近隨順轉成（易成正等菩提）。」\n《清涼記》：「此十六中，前八爲生南洲人之共法，後八爲即生能成大般若之特法，生圓次\n第中説，即身成佛，必須具此十六殊勝性。」\n",
"a3_kosa_69":"《俱舍論》卷五：「如有人處稠林，有三怨敵，欲爲\n損害。一從稠林牽之令出，一衰其力，一壞命根。三相於行，應知亦爾。」\n",
"a3_kosa_70":"《麟記》卷六：「如天授與筏第遮經。」\n",
"a3_kosa_71":"《順正理論》卷十六：「同一果義，是俱有因。又展\n轉力同生住等，是俱有因……有餘師説，由互爲果義立俱有因，如商侣相依共遊險道。」\n《大毗婆沙》卷十六：「同一果義是俱有因……同一生一老一住一滅一果一等流一異熟義是\n俱有因……心與心所法爲俱有因，心所法與心爲俱有因……評曰：心與隨心轉身語業展轉爲\n俱有因。所以者何？同一果故，辦一事故。」\n",
"a3_kosa_72":"《俱舍釋論》卷四：「俱有因相云何？偈曰：俱有互\n爲果。釋曰：若法此彼互爲果，此法遞爲俱有因。其譬類云何？偈曰：如大心心法，隨心相\n所相。釋曰：譬如地等四大，此彼更互爲因。心於隨心法，隨心法於心，有爲相於有爲法，\n有爲法於有爲相。若立如此義，一切有爲如理皆成俱有因。若離更互爲果，謂法於隨相爲俱\n有因，隨相於法則非，應攝如此義。」\n",
"a3_kosa_73":"《光記》卷六：「此中應辨，若依婆沙十六評家云：\n同一果義是俱有因義。又正理十五云：有爲法一果可爲俱有因。二論意同。正理論意，以互\n爲果名俱有因有過失故，更釋言，有爲法中展轉有力同得一果者名俱有因。若作俱舍師救汝\n言同一果名俱有因，爲據同時，爲據異時？若據同時同一果者，如心心所等自體望自體不同\n一果，應非俱有因。若言除自體與餘法同一果，是即隨相。若望本法同得一大相果，應望本\n法互爲俱有因。若言有同一果名俱有因，如心心所等。有同一果，非俱有因，如隨相望本法\n。我但言同一果中得爲俱有因，不言但是同一果者皆是俱有因。若作此救，是即同一果言非\n爲定證。若據異時同一果者，如本法與大相同得後一果，隨相與大相亦同得後一果。是即本\n法與相、隨相展轉相望皆同得後一果。既爾，隨相望於本法應名俱有因。進退徵責俱多過失\n。以理尋思，互爲果證過失乃少。但是互爲果者，定是俱有因。不言是俱有因者，皆互爲果\n。雖互爲果不遍俱有因。」\n",
"a3_kosa_74":"《法義》卷六：「法與隨相（至）此中應辨，四辨因\n果寬狹通妨。初二句舉妨難，然法下通，下一句明攝在。難云：法與隨相非互爲果，應非俱\n有因所攝，何云遍攝？通云：然法望隨相爲俱有因，故依此義，此俱有因中應辨攝。初與相\n違義，次下爲與義各别。舊論曰：俱有爲因，若離更互爲果，謂法於隨相爲俱有因，隨相於\n法則非，應攝如此義（已上）。辯與辨通，具義也。光、寶並未得論旨，如光出有部互爲果\n爲俱有因過，此中應辨句勸通釋於彼，圓暉依之，是迷之甚。婆沙中有部於何立互爲果義，\n復若破互爲果爲論主據何義，若言破置，顯依經部。此義不然，以不舉經部故。寶疏辨差别\n者似得，而此中應辨句入下甚非也，辨所攝句故。有人引正理論十五（六左）彼應更辨文，\n加勢光記屬上。今云：彼正理全非例，破此論主結辨釋文故。彼曰：（【傍】光師迷此文，\n云出有部，失歟！）又不可説唯互爲果爲俱有因，法與隨相非互爲果，然爲因故，彼應更辨\n。今辨具義，天地殊别。」\n",
"a3_kosa_75":"《俱舍論》卷六：「若爾，異身所緣行相及時同者應\n説相應，如衆同觀初月等事。爲以一言總遮如是眾多妨難，故説同依。謂要同依心心所法，\n方得更互爲相應因。」\n",
"a3_kosa_76":"《俱舍論》卷六：「相應因體即俱有因，如是二因義\n何差別？由互爲果義立俱有因，如商侣相依共遊險道；由五平等共相應義立相應因，即如商\n侣同受同作食等事業，其中缺一皆不相應，是故極成互爲因義。」\n",
"a3_kosa_77":"《俱舍論》卷六：「此與染法爲通因故，同類因外更\n别建立。亦爲餘部染法因故，由此勢力，餘部煩惱，及彼眷屬，亦生長故。」\n",
"a3_kosa_78":"《暉鈔》卷二：「六因次第者：能作因體通七十五法\n，寬故先説第一；俱有因即七十二法，次寬説在第二；同類因通七十二法，與俱有因體等，\n不通未來世，狹俱有因，説在第三；相應因雖通三世，即唯心王心所，狹同類因，説在第四\n；遍行因就心心所唯染者，狹相應因，説在第五；異熟因若欲界即通五部，若遍行因即二部\n一分，據上八地，異熟因即唯修部，遍行因二部一分，狹遍行因，説在第六。」\n",
"a3_kosa_79":"《俱舍論》卷六：「所言異熟，其義云何？毗婆沙師\n作如是釋：異類而熟，是異熟義。謂異熟因，唯異類熟。俱有等因，唯同類熟。能作一因，\n兼同異熟。故唯此一，名異熟因。熟果不應餘因所得，果具二義方得熟名：一由相續轉變差\n别，其體得生；二由隨因勢力勝劣，時有分限。非彼俱有相應二因所生果體要由相續轉變差\n别方乃得生，由取果時，即與果故；又非能作同類遍行三因之果亦由隨因勢力勝劣，時有分\n限，由善惡等，窮生死邊，果數數生，時無限故。由此但應作如是釋：變異而熟，是異熟義\n。不應但異，簡别餘因。」\n",
"a3_kosa_80":"《俱舍釋論》卷四：「偈曰：無爲非因果。釋曰：無\n爲法不可立爲因果，何以故？非六因故，非五果故。云何不許聖道爲擇滅隨造因？由不能遮\n應起法生故，立此爲隨造因。無爲無生，是故於無爲不成因。若爾是何法果？云何爲果？是\n道果，由道力至得故。若爾但至得是道果，於至得道有功能故。擇滅則非有别義，聖道於至\n得有功能。有别義道於擇滅有功能，於至得功能云何能令生，於擇滅功能云何能令至得？是\n故聖道於擇滅非一向因，擇滅於聖道非一向果，可是增上果。云何無爲成隨造因？不遮他生\n故，成隨造因。此法無果，解脱法無取果與果時，由無功能故……」\n",
"a3_kosa_81":"彼無因故：有本作「彼無現用」。《俱舍論》卷六作\n「彼無用故」。\n",
"a3_kosa_82":"《俱舍論頌講記》：「對於六因而立五果，固已如上\n所説，但於此成爲問題的，就是在那因果之間的時間關係怎樣？經部，是主張異時因的；有\n部，是承認有同時因果的。因果關係，以賽姆斯的話説，就是一切條件的總計。所以在這之\n間，有明前後、俱時等區别的必要。關於這個，有部立取果與與果的二種區别。取果，正指\n果體實成的當體，相當於那質料因；與果，是指實現其果的作用，相當於那動力因。凡是因\n，都可説含有這二種作用。論文把他的定義解説爲：能爲彼種故名取果（種是因義，現在爲\n因，能取後果）；正與彼力故名與果（與是給與，謂果將生，因與力用，令入現在）。依此\n説明六因五果的關係（五取果唯現，二與果亦然，過現與二因，一與唯過去）。」（上册第四〇四頁）\n",
"a3_kosa_83":"《俱舍論頌疏》卷十七：「唯邪見斷善者，唯有上品\n圓滿邪見，能斷善根。然本論中説貪瞋癡三不善根能斷善者，由不善根能引邪見，故邪見斷\n推在彼根。如火燒村，火由賊起，故世間説被賊燒村。所斷欲生得者，所斷善根，唯是欲界\n生得善也。謂斷善時，色無色善，先不成故，不可説斷。問：何緣唯斷生得善根？答：加行\n善根，先已退故。謂斷善根，先加行位，捨加行善。至斷善時，唯斷生得……漸斷者，明斷\n善根漸斷而非頓斷。謂九品邪見，斷九品善根，逆順相對斷。初下下品邪見，能斷上上品善\n根，乃至上上品邪見，能斷下下品善根。善根從上品至下品名逆也，邪見從下至上名順也。」\n",
"a3_kosa_84":"《暉鈔》卷三：「為因義成，方是取果，此是四緣，\n故不論取果，但言與果用也。」\n",
"a3_kosa_85":"《暉鈔》卷三：「問：等無間緣，及因緣中三因，於\n正生位，所緣及因緣中二因，於正滅位，即前後相違，如何言心心所法四緣生？答：正理論\n云：於正滅位，作用方成，而法生時，非無功力，離彼此法必不生故。正生及正滅，皆是果\n法正生及正滅，不取緣正生及正滅時。增上緣於未來及現在二世，皆與果力令生。故通正生\n及正滅時，與果用也。」\n",
"a3_kosa_86":"《解深密經》卷一：「阿陀那識甚深細，一切種子如\n瀑流，我於凡愚不開演，恐彼分别執爲我。」\n",
"a3_kosa_87":"故無生界理：此處疑誤。\n",
"a3_kosa_88":"《雜阿毗曇心論》卷九：「問：十二法欲界善不善隱\n没無記不隱没無記，色界三除不善，無色界三亦如是，及學無學。此十二法幾穢污心中得，\n幾善心中得，幾無記心中得？答：若得九種法，當知穢污心，善心得六種，無記即無記。若\n得九種法當知穢污心者，界及地來還時，欲色界得七心（上界没還生色界時得欲界化無記心\n及色界三心），及欲界善。善根續時得退時，得三界穢污及學心，餘不得者，謂無色界善不\n隱没無記及無學，雖無色界善少有退得，謂退分。但此中説悉不成就而得，此則通説，非一\n人一心中得九法。善心得六種者，善心中得六心，欲界不隱没無記，色界善不隱没無記，無\n色界善及學無學亦通説，非一時得。無記即無記者，不隱没無記即得無記非餘，羸劣故。」\n",
"a3_kosa_89":"無：疑爲「天」。據《集註》三二〇頁。\n",
"a3_kosa_90":"《寶疏》卷八：「論復説若處至故非識住，述異釋也。准\n此論文，豈可第四靜慮處三天異生，皆悉愛慕無想異熟處耶？應非正義。正理論云：有餘師\n説，衆生有三，所謂樂著諸境、樂、想。樂著境者，人及欲天。樂著樂者，下三靜慮。樂著\n想者，下三無色。唯依此處，立識住名。餘無此三，故非識住。」\n",
"a3_kosa_91":"《順正理論》卷二三：「生謂當來所應至處，依所至義，\n建立生名。此中有身，體雖起殁，而未至彼，故不名生。體謂此中異熟五藴，此但名起，不\n説爲生，死生有中，暫時起故。或復生者，是所起義。中有能起，所以非生。所起者何？謂\n業所引，異熟五藴，究竟分明。」\n",
"a3_kosa_92":"陿：同「狭」。\n",
"a3_kosa_93":"《菩提道次第廣論》卷二四（第五五二頁）。\n",
"a3_kosa_94":"《菩提道次第廣論》卷十七：「若謂此中，豈非宣説悟入\n大乘真實之法，故唯滅盡我、我所執，非是所得真實性義。又唯決擇我及我所悉無自性，亦\n未決擇諸法無我，故名悟入真實之道，不應正理。答曰：無過。於一切種永滅我、我所執，\n略有二種。一、若以煩惱更不生理而永斷者，雖於小乘亦容共有，然由永斷内外諸法戲論之\n相皆無可得，即是法身。又若通達我無自性，於彼支分諸藴亦能滅除有自性執。譬如燒車，\n則亦燒毁輪等支分。」（第四〇七頁）\n",
"a3_kosa_95":"《瑜伽師地論》卷二：「即此肉搏增長，支分相現，名缽羅奢佉。」\n",
"a3_kosa_96":"見《解深密經》卷一。\n",
"a3_kosa_97":"《俱舍論》卷十：「夫名食者，必先資益自根大種，後乃\n及餘。飲噉色時，於自根大，尚不爲益，況能及餘？由彼諸根，境各别故。」\n",
"a3_kosa_98":"《成唯識論》卷四：「（謂契經説食有四種。）一者\n段食，變壞爲相，謂欲界繫香味觸三，於變壞時，能爲食事。由此色處，非段食攝，以變壞\n時，色無用故。」\n",
"a3_kosa_99":"《順正理論》卷三十：「色處何緣不名爲食？是不至\n取根所行故。以契經説，段食非在手中器中可成食事，要入鼻口，牙齒咀嚼，津液浸潤，進\n度喉嚨，墮生藏中，漸漸消化，味勢熟德，流諸脉中，攝益諸蟲，乃名爲食。爾時方得，成食事故。」\n",
"a3_kosa_100":"《成唯識論》卷四：「二者觸食，觸境爲相，謂有漏\n觸，纔取境時，攝受喜等，能爲食事。此觸雖與諸識相應，屬六識者，食義偏勝。觸粗顯境\n，攝受喜樂，及順益捨，資養勝故。三意思食，希望爲相，謂有漏思，與欲俱轉，希可愛境\n，能爲食事。此思雖與諸識相應，屬意識者，食義偏勝，意識於境，希望勝故。」\n",
"a3_kosa_101":"《成唯識論》卷四：「識食，執持爲相，謂有漏識，\n由段觸思，勢力增長，能爲食事。此識雖通諸識自體，而第八識食義偏勝，一類相續，執持\n勝故。由是集論，説此四食，三藴五處十一界攝。此四能持有情身命，令不壞斷，故名爲食。」\n",
"a3_kosa_102":"《成唯識論述記》卷四：「即此三界，此三一切皆是\n食耶？於變壞時能爲食事，非未變壞説爲段食。即非此三一切皆食。對法五説：有變壞故，\n有變壞者，資益之時，方名食故。初食未壞，但觸所得，六十六説名爲觸食。望一食者，非\n望餘生。若望一切，有非是食。」\n《成唯識論了義燈》卷四：「段食之體，於變壞已有資長攝持，方名爲食。雜集第五云：有\n變壞故，有變壞者。變壞故，即香、味、觸體變壞時。變壞者即資持之用。問：爲正變壞時\n名食，爲長養資持之時方名爲食？答：資持用時，方名爲食。故瑜伽六十六云：若諸段物，\n於吞咽時，令心歡喜，諸根悦豫，當於爾時，不名段食，但名觸食。若受用已，安隱消變，\n增長喜樂，於消變時，乃名段食。未資長時，但是觸食者，望生喜樂及順益捨可爲觸食，不\n爾亦非。故本疏云：名爲觸食。望一食者非望餘生，若望一切有非是食，此意即於所食香、\n味、觸，有不生喜樂等，即非觸食。」\n",
"a3_kosa_103":"《成唯識論述記》卷四：「問：何故色處非段食耶？\n論：由此色處至色無用故。述曰：勝定果色，亦色處類，非變壞時，能爲資益，故非段食。\n以變壞時，色於自根，不能資益。於其自根，既無資用，於餘根等亦無作用，不資養等。又\n色粗著，與根相離，方能爲境。不與根合，故非是食。聲體疎遠，離質用興，不能資益，故\n非是食。問：此三爲食，爲對自根，亦對餘識？答：此三入腹，變壞之時，先資自根，爲資\n養已，然後乃能資諸根等。發識明利，説名爲食，非要别對，自識所取。」\n",
"a3_kosa_104":"此：頌文中爲「次」。\n",
"a3_kosa_105":"《麟記》卷十：「婆沙説食於二時，能爲食事，俱得\n名食。一初食時能除飢渴，二消化已資益根及大。今地獄有初一義，故亦名食。」\n",
"a3_kosa_106":"淡：據大正藏，為「痰」，疑為衍文。\n",
"a3_kosa_107":"《俱舍論》卷十：「一者衣服嚴具出非愛聲，二者自\n身光明忽然昧劣，三者於沐浴位水滴著身，四者本性囂馳今滯一境，五者眼本凝寂今數瞬動\n。此五相現非定當死。」\n",
"a3_kosa_108":"能海上師《慧行習練刻意成念記講録》：「惡友者，\n能令人壞三寶、壞戒、壞因果，凡與我慢隨順者，皆惡友也。經云：寧墮地獄，勿遇惡友。\n地獄之苦，猶有出期；惡友引人，造業受報，其苦無盡。不遇惡友，須常發願。師長常教我\n等發願，勿遇惡友，設遇、願彼勿發言，設發言、勿説邪知見語，設説、願我不聞，設聞、\n願我不信，若萬一被其所惑，願我速能覺悟改悔，常如此啟白，則能遠離惡友之害矣。」\n",
"a3_kosa_109":"舍搋洲：此據《俱舍論》，《頌疏》中爲「舍𢮎洲」。\n",
"a3_kosa_110":"千：《俱舍論》作「十」。\n",
"a3_kosa_111":"分折：《俱舍論》作「分析」，下兩處亦同。\n",
"a3_kosa_112":"《光記》卷二三：「聲聞極疾三生修加行，極遲六十\n劫修加行，若據獨覺，極疾四生修加行，極遲百劫修加行。若據佛乘，極疾三無數劫及餘九\n十一劫修加行，若極遲者三無數劫及餘百劫修加行。」\n",
"a3_kosa_113":"《俱舍論》卷十二：「何緣獨覺言不調他？非彼無能\n演說正法，以彼亦得無礙解故。又能憶念過去所聞諸佛所宣圣教理故。又不可說彼無慈悲，\n為攝有情現神通故。又不可說無受法機，爾時有情亦有能起世間離慾對治道故。雖有此理，\n有彼宿習少欣樂勝解，無說希望故。又知有情難受深法，以順流既久難令逆流故。又避攝眾\n故，不為他宣說正法，怖喧雜故。」\n",
"a3_kosa_114":"《俱舍論》卷十二：「故契經言，若王生在刹帝利種\n，紹灑頂位。於十五日受齋戒時，沐浴首身，受勝齋戒。昇高臺殿，臣僚輔翼，東方忽有金\n輪寶現，其輪千輻，具足轂輞，衆相圓淨，如巧匠成。舒妙光明，來應王所，此王定是轉金\n輪王。轉餘輪王應知亦爾。」\n",
"a3_kosa_115":"見《佛說阿彌陀經》卷一。\n",
"a3_kosa_116":"《麟記》卷十二：「佛大士相處正明圓者，處正當處\n，如千幅輪相，正當足下。明者分明，如千幅輪相明顯，圓謂圓滿，如千幅等具足。」\n",
"a3_kosa_117":"《麟記》卷十二：「然劫章疏説，至三十有飢饉灾，\n二十歲有疾疫灾，十歲有刀兵灾，與此不同。」\n",
"a3_kosa_118":"蔽：《頌疏》作「弊」，依《俱舍論》校正。\n",
"a3_kosa_119":"《佛説觀無量壽佛經》卷一：「中品中生者，若有衆\n生，若一日一夜持八戒齋，若一日一夜持沙彌戒，若一日一夜持具足戒，威儀無缺，以此功\n德，迴向願求生極樂國，戒香薰修。如此行者命欲終時，見阿彌陀佛與諸眷屬放金色光，持\n七寶蓮花至行者前。行者自聞空中有聲，讚言：善男子，如汝善人，隨順三世諸佛教故，我\n來迎汝。行者自見坐蓮花上，蓮花即合，生於西方極樂世界。在寶池中，經於七日蓮花乃敷\n，花既敷已，開目合掌讚歎世尊，聞法歡喜得須陀洹，經半劫已成阿羅漢。是名中品中生者。」\n",
"a3_kosa_120":"見《增一阿含經》第四十卷第七經。\n",
"a3_kosa_121":"《順正理論》卷三五：「何緣散地所有無表能造大種，唯\n等流性，定地無表，所長養生？以殊勝心現在前位，必能長養大種諸根，故定心俱，必有殊\n勝長養大種，能作生因，造定心俱所有無表。散地無表，因等起心，不俱時故，在無心位，\n亦有起故，所依大種，唯是等流。因等起心，不能長養能生無表諸大種故。」\n",
"a3_kosa_122":"《孔子家語》：「故曰：與善人居，如入芝蘭之室，久而\n不聞其香，即與之化矣。與不善人居，如入鮑魚之肆，久而不聞其臭，亦與之化矣。」\n",
"a3_kosa_123":"《順正理卷》三六：「由是無記唯有二種，一者勝義，二\n者自性。有為無記是自性攝，不待別因成無記故。無為無記是勝義攝，以性是常，無異門故。」\n《俱舍論記》卷二：「自性無記者有十法，謂得、非得、四相、名、句、文，同分。於不相\n應中異熟等四所不攝者，諸餘無記皆自性攝。于心所中異熟等四攝無記盡，故自性無記不攝\n心所法。勝義無記者有二法，謂虛空、非擇滅。色界聲界至餘是無記者，此即別明色、聲。\n色、聲二界，若善心力等起身表、語表攝是善，若不善心力等起身表、語表攝是不善，若無\n記心力等起身表、語表攝是無記，及非等起色、聲皆名無記，以無記色、聲中有非等起故，\n不別說等起。以實而言，無記心亦能等起身表、語表業。若別分別，生得、聞、思者皆通色\n、聲，以皆能作等起故，加行故發業。如前已說。不善者通色、聲。有覆者通色、聲，謂初\n定中有覆修惑等起身、語。異熟者謂色威儀、工巧、通果。自性者，皆通色、聲，異熟等四\n所不攝者，皆名自性無記。」\n",
"a3_kosa_124":"《俱舍論頌疏義鈔》卷二：「梵云苾蒭，此云乞士等。舊\n云比丘，訛也。是西國草名，具五義四德，五義者，一草未生，諸草競生，況佛未出世，外\n道皆興。二此草生已，諸草皆滅，況佛出世，外道投佛出家。三此草生已，掩諸嗅氣，況佛\n所至之處，止諸惡事。四此草不被挺風猛傾動，況佛八風不動。八風頌曰：利衰毀譽，稱譏\n苦藥。五此草不被塵垢染污，況佛破戒垢不能染污。四德者，此草柔軟，香氣遠騰。二引蔓\n傍布，鉤鏁相連。三此草向佛傾。四此草如來涅槃悉變白。苾蒭具前五義四德，取草名也。」\n《四分律行事鈔簡正記》卷九：「苾蒭者，戒疏云，傳訛也，因草以立，謂西國有草，名曰\n苾蒭。此草具四德五義。堪喻出家之士。四德者，眾草生時，此草未生，表佛未出世時，一\n切外道，邪徒興盛。二此草生時，眾草即滅沒。三不容垢，表無破戒塵垢故。四引夢滋多，\n表師資無絕。所言五德者，一莖芋端直，表內心質直。二香氣遠勝，表戒香普熏。三體性柔\n耎，表於慈悲。四不皆曰，表不違佛制。五冬夏長青，表始終不變。具上諸義，故以彰名。\n若云比丘，此云怖魔，果中能斷惑。二云乞士，出家已，乞食自濟身，乞法以濟神等（云云）。」\n",
"a3_kosa_125":"《麟記》卷十四：「信受佛得戒者，謂世尊告迦葉言：汝\n當發慚愧心，徹於骨髓。彼在多子塔邊，發誠誓言：世尊是我大師，修伽陀是我大師。如是\n二言，便發具足。然此得戒，始終三名。一名教授，即是初義。二名身誓，三名上法，即自\n證衆會增上之法。今章言信受佛爲大師，是即當第二義。」\n",
"a3_kosa_126":"《麟記》卷十四：「蘇陀夷，此云善施。增一阿含廣明其\n相。謂佛於摩竭國波沙山，即命蘇陀夷言：今問卿義，諦聽善思。對曰：如是。世尊告曰：\n有常色、無常色，爲一義，爲若干？答曰：若干，非一義也。（解云：有常色者，謂如來常\n身，非謂凡夫六根所取；無常色者，謂外色聲，六根所引也。）又問：有漏無漏義爲一若干\n？答曰：若干，非一也。有漏謂生死，無漏爲涅槃。如是多問，彼皆具答，稱可佛心。世尊\n讚曰：摩竭國界快得善利，今聽此沙彌僧中受戒。由聰明善巧酬答故，别開此緣，非酬答時\n，即發戒也。」\n",
"a3_kosa_127":"《大毗婆沙》卷一二四：「問：若至午後，受此戒者，亦\n得戒不？答：應言不得，除先要期，月八日等，恒受齋戒。彼有餘緣，午前不憶。食已方憶\n，深生悔愧。即請戒師，如法受者，亦得此戒。」\n",
"a3_kosa_128":"《略論釋》：「兩手屈大指合置掌中，表不空，捧如意寶\n……兩手緊貼，乃外道相。兩手空，感生無佛邊地。」\n",
"a3_kosa_129":"《俱舍論》卷十五：「非屠羊等不律儀人於己至親有\n損害意，乃至爲救自身命緣亦不欲殺，如何可説普於一切得不律儀？由彼至親若爲羊等於彼\n亦可有損害心。既知至親現非羊等，如何於彼可有害心？又聖必無作羊等理，如何於彼得不\n律儀？若觀未來羊等自體，於現相續得不律儀，是則羊等於未來世亦有至親及聖自體，於彼\n決定無損害心，是則應觀未來自體，不於現在得不律儀。於羊等現身既有害意，如何不於彼\n得不律儀？於母等現身既無害意，如何亦於彼得不律儀？於等事中應求異理。」\n",
"a3_kosa_130":"《光記》卷十五：「言煮狗者，謂旃荼羅等諸猥惡人\n，造諸惡類，西國呼爲煮狗人，非常煮狗，或可煮狗以充所食，西方汗狗，故以標名。」\n",
"a3_kosa_131":"《光記》卷十五：「非此諸業至此中名受者，非此諸\n三受業唯感受果，應知亦感彼受資糧，除受餘四藴資助受故名受資糧，受及資糧此中總名爲\n受。唯言受者，從强説故，相從説故，受資糧故。」\n",
"a3_kosa_132":"順現受業：疑為「順樂受業」。\n",
"a3_kosa_133":"無：疑衍。\n",
"a3_kosa_134":"《疏抄》卷十六：「北洲綺語，有輕有重，重者成業道，\n輕者非業道。一歌詠等正是獨起雜穢語故，雖非極重，亦成業道。」「問：劫增輪現時，亦\n有歌詠，如何不是雜穢語收？答：由彼語從出離心發，歌詠之中，毁呰十惡，讚歎十善，能\n引十善，出離三塗，非預染心。如佛詠言煩惱深無底，生死海無邊，度苦般未立，云何樂睡\n眠等。」《光記》卷十六：「身三業道損他是重，輪王北洲一向不起。故身業等不説輕也。\n或飲酒等，即是身輕。」\n",
"a3_kosa_135":"《順正理論》卷四一：「有餘師説：貪瞋邪見，纔現在前\n，即名業道，故無加行、後起差别。如是説者，亦具三分，有不善思，於貪瞋等，能爲前後助伴事故。」\n",
"a3_kosa_136":"《順正理論》卷四一：「如依吠陀及餘邪論，習學諷詠，\n傳授於他，謂無罪愆，皆從癡起。」\n",
"a3_kosa_137":"《俱舍論》卷十六：「貪瞋等三既無加行，如何可説從貪\n等生？以從三根無間生故，可説貪等從三根生。」\n",
"a3_kosa_138":"《光記》卷十六：「及餘依前根本業道第二念已去，相續\n隨轉作諸表業，相續隨轉起無表業，皆名後起。」\n",
"a3_kosa_139":"《光記》卷十六：「邪行雖復唯於有情，眾具勝故存眾具\n名。又盜等三，制罪義邊皆待有情，眾具勝故，立眾具名。」\n",
"a3_kosa_140":"非墮邪見：疑誤，《俱舍論》作「非墮邪定」。\n",
"a3_kosa_141":"《光記》卷十七：「地獄中有生得智，知前生造業，來生\n此中，現見業果，故無邪見業道現行。」\n",
"a3_kosa_142":"《寶疏》卷十七：「此三（貪、瞋、邪見）離欲捨故\n，北洲無離欲，故定有成就。」\n",
"a3_kosa_143":"《大智度論》卷十九：「問曰：何等是五種邪命？答\n曰：一者，若行者爲利養故，詐現奇特；二者，爲利養故，自説功德；三者，爲利養故，占\n相吉凶，爲人説；四者，爲利養故，高聲現威，令人畏敬；五者，爲利養故，稱説所得供養\n以動人心。邪因緣活命，是爲邪命。」\n",
"a3_kosa_144":"漏業：疑爲「滿業」。\n",
"a3_kosa_145":"《四分律》卷四：「如來常稱説頭陀少欲知足樂出離\n者，我今有五法，亦是頭陀勝法，少欲知足樂出離者；盡形壽乞食，盡形壽著糞掃衣，盡形\n壽露坐，盡形壽不食酥鹽，盡形壽不食魚和肉。我今持此五法教諸比丘，足令信樂。」\n",
"a3_kosa_146":"《順正理論》卷四三：「唯破異生非破聖者，他不能\n引得證淨故，有説得忍亦不可破，由決定忍佛所説故。」\n",
"a3_kosa_147":"「少」字疑衍。\n",
"a3_kosa_148":"《順正理論》卷四三：「本論不言無間加行皆不可轉\n，但説加行不息，死者定生地獄。加行息者非彼所論。然我所宗，無間加行總説有二，一近\n二遠。於中近者，不可轉故，本論依之，而興問答。謂有於母起害加行，纔擊無間母命未終\n，或母力强反害其子，或爲王等擒捉而殺，或子壽盡自致命終，本論依斯作如是説。於中遠\n者，由尚未至不可轉位，容有可轉。」\n",
"a3_kosa_149":"「超」疑爲「起」。\n",
"a3_kosa_150":"《大毗婆沙》卷一八三：「問：何故世尊不決定説法\n住時分耶？答：欲顯正法隨行法者住久近故。謂行法者若行正行，恒如佛在世時，及如滅度\n未久時者，則佛正法常住於世，無有滅没。若無如是行正法者，則彼正法速疾滅没。如佛告\n阿難陀言：於我善説法毗柰耶中，若當不度女人出家者，我之正法應住千歲，或復過此。由\n度女人出家故，令我正法減五百歲。問：若正法住猶滿千年，何故世尊作如是説？答：此依\n解脱堅固密意而説。謂若不度女人出家，應經千歲解脱堅固，而今後五百歲，唯有戒聞等持\n堅固非解脱者，皆是度女人出家之過失耳。有餘師説，此依若不行八尊重法密意而説。謂若\n度女人出家，不令行八尊重法者，則佛正法應減五百歲住，由佛令彼行八尊重法故，正法住\n世還滿千歲。」\n",
"a3_kosa_151":"牛王：喻佛。《勝鬘經》卷一：「如牛王形色無比，\n勝一切牛。」《無量壽經》卷二：「猶如牛王，無能勝故。」\n",
"a3_kosa_152":"難奪財，如《舊雜譬喻經》卷上第二十七「金環」故事選。\n",
"a3_kosa_153":"《俱舍論》卷十八：「法師四田中是何田所攝？是恩\n田攝。所以者何？爲諸世間大善友故，無明所盲者能施慧眼故，開示世間安危事故，令有情\n生起無漏法身故。以要説者，善説法師，乃至能爲佛所作事故。」\n",
"a3_kosa_154":"見《雜寶藏經》卷一「慈童女緣」。\n",
"a3_kosa_155":"《俱舍論》卷二三：「論曰：此煖、頂、忍、世第一\n法四殊勝善根，名順決擇分。依何義建立順決擇分名？決謂決斷，擇謂簡擇，決斷簡擇謂諸\n聖道，以諸聖道能斷疑故，及能分别四諦相故。分謂分段。此言意顯，所順唯是見道一分，\n決擇之分故得決擇分名。此四爲緣引決擇分，順益彼故得順彼名，故此名爲順決擇分。」\n",
"a3_kosa_156":"《大乘義章》卷六：「所言使者，如地論説，隨逐縛義，\n名之爲使。蓋乃就喻以名煩惱，如世公使，隨逐罪人，得便繫縛。煩惱亦爾，久隨行人，繫\n縛三有，不令出離，故名爲使。毗曇、成實亦同此説。故雜心云：使之隨逐，如空行影，影\n水行隨。成實説言：使之隨逐，如母隨子，亦如瘧病鼠毒未發，如熱鐵黑相，如種中芽，如\n債未還，此等皆是隨逐義也。」\n",
"a3_kosa_157":"《光記》卷十九：「一分者，謂異生時發願，當爲藹羅筏\n拏大龍王等。正理云：等言爲顯阿素洛王、北俱盧洲、無想天等。藹羅筏拏是水名，水中龍\n象，從水爲名，即是帝釋所乘龍象王也。故正理七十五説藹羅筏拏大象王，是三十三天所乘象王。」\n",
"a3_kosa_158":"已：疑爲「以」字。\n",
"a3_kosa_159":"《光記》卷十九：「若治欲界，謂未至定中法智品道能治\n欲者。若能治餘，謂六地中滅、道法智品，於修道位能治餘色界、無色界者。皆彼邪見、疑\n、無明所緣，以法智品類同故。」\n",
"a3_kosa_160":"何：疑爲「可」。\n",
"a3_kosa_161":"折：《俱舍論》中作「析」。\n",
"a3_kosa_162":"《集異門足論》卷六：「四聖諦者，一、苦聖諦，二、苦\n集聖諦，三、苦滅聖諦，四、趣苦滅道聖諦。云何苦聖諦？答：五取藴，謂色取藴、受取藴\n、想取藴、行取藴、識取藴，是名苦聖諦。云何苦集聖諦？答：諸有漏因，是名苦集聖諦。\n云何苦滅聖諦？答：擇滅無爲，是名苦滅聖諦。云何趣苦滅道聖諦？答：諸學法、無學法，\n是名趣苦滅道聖諦。」\n",
"a3_kosa_163":"見《長阿含經》卷一九（第四分世記經龍鳥品第五）。\n",
"a3_kosa_164":"《俱舍論頌疏》卷十九：「見滅道所斷，邪見疑相應，及\n不共無明，六能緣無漏。於中緣滅者，唯緣自地滅。緣道六九地，由别治相因。貪瞋慢二取\n，並非無漏緣，應離境非怨，靜淨勝性故。」\n",
"a3_kosa_165":"《俱舍論頌疏》卷二六：「緣滅道法智，於修道位中，兼\n治上修斷，類無能治欲。釋曰：修道所攝滅、道法智，斷欲界已，兼能對治上界修斷。欲之\n滅道，勝上界故。已除自怨，兼除他敵故。由此類智，無能治欲。」\n",
"a3_kosa_166":"《大毗婆沙論》卷六三：「問：若已離色染入正性離生者\n，彼何時得色愛盡遍知？……應作是説：彼定從果起勝進道現在前時，方乃得此色愛盡遍知\n。若不許彼決定從果起勝果道現在前者，諸已離第三靜慮染，依下地入正性離生道類智時，\n得第三果。既不起勝果道現在前，彼若命終生第四靜慮或無色界，應不成就無漏樂根，若爾\n便違十門納息。如説誰成就樂根？答：若生遍淨，若生遍淨下，若聖者生遍淨上，勿有此失\n，故必應許諸得果已，彼定從果起勝果道，爾時方名得色愛盡遍知。」\n",
"a3_kosa_167":"《俱舍論》卷二二：「云何由理？以諸樂因皆不定故。謂\n諸所有衣服飲食冷煖等事，諸有情類許爲樂因，此若非時過量受用，便能生苦，復成苦因，\n不應樂因。於增盛位，或雖平等，但由非時，便成苦因，能生於苦。故知衣等，本是苦因，\n苦增盛時，其相方顯。」\n",
"a3_kosa_168":"《法藴足論》卷三：「非爲求覓衣服因緣，令諸世間生譏\n論者，謂佛弟子，非如一類，爲求衣服往施主家，詐現威儀，矯設言論，現相研磨，以利求\n利，令諸世間多生譏論。諸佛弟子，與彼相違故，不令他生諸譏論，若求不得終不懊嘆等者。」\n",
"a3_kosa_169":"《法藴足論》卷三：「於受用時，能見過患，正知出離者\n，謂佛弟子，受用所得，諸衣服時，能見過患，謂此衣服，無常轉動，求時勞倦，受用非理\n，生長疾病，是失壞法，是增減法，暫得還失，迅速不停，本無今有，有已還無，不可保信\n；又受用時，正知出離，成就趣向，出離慧故，爲趣涅槃，受用衣服；又受用時，先調貪欲\n，次斷貪欲，後出貪欲。由此因緣，心於衣服，離染解脱。」\n",
"a3_kosa_170":"《大毗婆沙論》卷十一：「有三種作意：謂自相作意，共\n相作意，勝解作意。自相作意者，思惟色是變礙相，受是領納相，想是取像相，行是造作相\n，識是了别相，地是堅相，水是濕相，火是煖相，風是動相，如是等。共相作意者，如十六\n行相等。勝解作意者，如不淨觀持息念，無量解脱勝處遍處等。」\n",
"a3_kosa_171":"《寶疏》卷二三：「論：若爾何殊順解脱分？問：順解脱\n分善亦必得涅槃，煖既與同，有何殊也？論：若無障礙至行相同故。答：定得涅槃，二種雖\n同，近遠異也。順解脱分極疾第三生得聖，順決擇極疾即此生得。正理論云：是等引地勝善\n根故。（解云：解脱分是散地善，此是定善與散異。」）\n",
"a3_kosa_172":"《俱舍論》卷二三：「諸得果位中，未得勝果道，故\n未起勝道，名住果非向。」\n",
"a3_kosa_173":"《麟記》卷二五：「述言覺分轉時必能得證淨者，轉\n之言起，起之言生，謂根力等覺分生時，必能獲得四證淨也。或從根力轉入證淨故。」\n",
"a3_kosa_174":"《俱舍論》卷二五：「聖所愛戒，與現觀俱。」\n",
"a3_kosa_175":"《大毗婆沙論》卷一〇一：「無學勝解復有二種：一\n時愛心解脱，即五種阿羅漢果所攝勝解，亦名時解脱；二不動心解脱，謂不動法阿羅漢果所\n攝勝解，亦名不時解脱。此二解脱各有二種：一名心解脱，離貪愛故；二名慧解脱，離無明\n故。問：若無學勝解離貪愛故名心解脱，離無明故名慧解脱者，集異門説當云何通，如説云\n何心解脱，謂無貪善根對治貪愛；云何慧解脱，謂無癡善根對治無明耶？答：集異門論應作\n是説，云何心解脱，謂無貪善根相應勝解；云何慧解脱，謂無癡善根相應勝解。應作是説而\n不説者，有别意趣，謂依善根顯示勝解。若依無貪故心解脱貪愛，此相應勝解名心解脱；若\n依無癡故慧解脱無明，此相應勝解名慧解脱。是故此中二心解脱，俱以無學勝解爲自性。」\n",
"a3_kosa_176":"見《景德傳燈録》卷五。\n",
"a3_kosa_177":"《光記》卷二六：「欲界滅、道勝於上界苦、集法故，故\n緣下勝能治上劣。欲苦、集粗，上苦、集細，緣粗不能治細，故苦、集法智不治上修惑。」\n",
"a3_kosa_178":"《大毗婆沙論》卷二九：「問：契經所説，復云何通？如\n説如實了知我生已盡，廣説乃至是何行相？答：如實了知我生已盡者，是緣集四行相；梵行\n已立者，是緣道四行相；所作已辦者，是緣滅四行相；不受後有者，是緣苦二行相，謂苦、非常。」\n",
"a3_kosa_179":"《舍利弗阿毗曇論》卷二七：「云何不繫心？若心聖無漏\n，是名不繫心。」\n",
"a3_kosa_180":"《光記》卷二六：「非常等八種行相，及有是處，處是稱\n合道理相容受義，及有是事，事謂事用，此十皆名如理所引了别。」\n",
"a3_kosa_181":"《光記》卷二六：「婆沙一百七云：法智緣下，類智緣上\n，故不相緣。如有二人同住一處，一人觀地，一人觀空，如是不相見面。」\n",
"a3_kosa_182":"《雜心論》卷六:「謂苦法智現在修，未來修苦法智，非\n忍非餘智，如是乃至道法智。」\n",
"a3_kosa_183":"《大毗婆沙論》卷三六:「問:何故此智名現觀邊？答：\n現觀苦邊、集邊、滅邊得此智，故名現觀邊。有説此是諸瑜伽師觀聖諦時傍修得故名現觀邊\n。尊者妙音説曰：此智近現觀故名現觀邊，如近村物名曰村邊。」\n",
"a3_kosa_184":"《光記》卷二六：「如契經説，善有爲法應修非餘。所以\n者何？若諸智者爲愛果故，精勤修習令漸增長，説名爲修。善有爲法能得愛果，謂得世間可\n愛異熟增上果故，亦得出世離繫果故，諸有智者精勤修習，從下至中從中至上，令速能獲得\n所求愛果。染、無記法及善無爲，無如是用，故不名修。」\n",
"a3_kosa_185":"《順正理論》卷七五：「若如實知諸有情類喜樂差别\n無罣礙智，名種種勝解智力。\n",
"a3_kosa_186":"宿住死生智力：疑爲「死生智力」。\n",
"a3_kosa_187":"見《過去現在因果經》卷二。\n",
"a3_kosa_188":"《暉鈔》卷三：「問：佛説法時，衆生不教，應無三\n念住，即世尊説法，應失根器。答：世尊説法，欲令人解之，人若不解，即天解之，人不解\n故，念住有三，天得解故，無不應根器失。」\n",
"a3_kosa_189":"《四教儀註彙補輔宏記》卷一：「盧舍那，翻淨滿，\n謂諸惡都盡，故淨；衆德悉圓，故滿，自報。亦翻光明遍照，他報。亦名尊特。亦名勝應。\n淨滿者，障淨爲先，德滿爲後，如言萬惡咸消，衆善普會也。梵網經疏言滿淨者，德滿爲先\n，障淨爲後，所謂富有萬德，蕩無纖塵也。光明遍照指爲他報者，若據慈恩三藏釋，則言身\n光智光，内外照故，目於報身，通自他二報佛也。尊特有上中下三品，今指下品，從丈六身\n，現起千丈舍那也。勝應，如來應身相好，有勝劣不同。今指勝者。華嚴佛有殊勝相好，對劣名勝也。」\n",
"a3_kosa_190":"《法苑珠林》卷二五：「目連承佛聖旨，西方有一世\n界名光明幡，佛名光明王，現在説法。目連到彼聽佛語，見其身長四十里，諸菩薩身長二十\n里，其諸菩薩所食缽器，其高一里。目連行缽際上，時諸菩薩白世尊曰：唯然大聖，此蟲從\n何而來，被沙門服行缽際上。於時彼佛言：諸族姓子，慎勿發心輕慢此賢，所以者何？今斯\n少年名大目連，是釋迦文佛聲聞弟子中神足第一。」\n",
"a3_kosa_191":"如是相續：《俱舍論》卷二七：「如是相智」。\n",
"a3_kosa_192":"《順正理論》卷七六：「義無礙解十、六智性，謂若\n諸法皆名爲義，則十智性；若唯涅槃名爲義者，則六智性,謂俗、法、類、滅、盡、無生。\n辯無礙解九智爲性，謂唯除滅，緣説道故。」\n",
"a3_kosa_193":"《光記》卷二七：「又正理云：有馀師言：有不具得\n，無理得一，必令得四。」\n",
"a3_kosa_194":"《大毗婆沙論》卷一八六：「問：隨依何靜慮發神境\n通，能至何處？答：依初靜慮發者，能至梵世。乃至依第四靜慮發者，能至廣果或色究竟。\n聲聞不作意傍極小千世界，作意極中千世界。獨覺不作意極中千世界，作意極大千世界。佛\n不作意極大千世界，作意能極無邊世界。如神境通，四通亦爾。」\n",
"a3_kosa_195":"《俱舍論》卷二七：「即此五通於世界境，作用廣狹\n諸聖不同。謂大聲聞、麟喻、大覺不極作意，如次能於一、二、三千諸世界境，起行化等自\n在作用，若極作意，如次能於二千、三千、無數世界。」\n",
"a3_kosa_196":"《俱舍論》卷二七：「非天眼通能知此事，有别勝智\n，是通眷屬，依聖身起，能如是知，是天眼通力所引故，與通合立死生智名。」\n",
"a3_kosa_197":"《俱舍論》卷二七：「又唯此三，令於佛法，如次歸\n伏、信受、修行，得示導名。」\n",
"a3_kosa_198":"見《雜譬喻經》。比喻行者宜應自修所向，不應恃託\n豪勢，一旦傾覆，與彼無異也。\n",
"a3_kosa_199":"《暉鈔》卷六：「肉眼見近不見遠，天眼遠近皆見；\n肉眼有同分、彼同分，天眼唯同分；肉眼見前不見後及不見左右，天眼前後左右皆見；肉眼\n見障内不見障外，天眼内外皆見；肉眼見粗不見細，天眼二皆見；肉眼見晝不見夜，天眼晝\n夜皆見；肉眼見明不見闇，天眼明闇皆見；肉眼有翳缺，天眼皆無也。」\n",
"a3_kosa_200":"《俱舍論》卷二八：「定靜慮體，總而言之，是善性\n攝心一境性。」\n",
"a3_kosa_201":"《麟記》卷二八：「泛論定名，總有三種：梵名三摩\n地（此云等持），通定散，通三性，唯有心，名如前解。梵名三摩缽底（此云等至），通有\n心無心，唯定非散，若有心，約離沉掉，平等而至此定故；若無心，約定中大種平等，亦名\n等至……梵云三摩呬多（此云等引），唯有心，唯定非散，謂能引起此定名引。」\n",
"a3_kosa_202":"《光記》卷二八：「問：七十五法中何故唯九立靜慮\n支，餘不立耶？解云：若順淨偏勝，與定同緣，立靜慮支，不爾不立。」\n",
"a3_kosa_203":"《順正理論》卷七八：「論曰：且有一類隨相説言，\n初染中無離生喜樂，非離煩惱而得生故。雖染污定亦喜相應，非因離生，故非支攝。此不唯\n説離欲生喜，亦説因離自地染生。以契經中先作是説，離諸欲惡不善法已，復作是言：離生\n喜樂。此中重説離生言者，爲顯亦有喜離自地惑生。爲顯喜支唯是善性，故薄伽梵與樂合説\n，輕安相應必是善故。由此染定必無喜支，故初染支唯有三種。」\n",
"a3_kosa_204":"《寶疏》卷二八：「問：生上三定，起下眼、耳二通\n是何無記？有人云：唯是威儀心，或是緣威儀心，或似威非變化無記。異熟非異地起，非異\n熟無記。以此故知，唯是自性。」借識是何無記？答：此借識心是自性無記。耳識非威儀，\n非威儀無記。上地無工巧，非工巧無記。變化唯在意，此故知，四無記心攝心不盡。既無記\n色攝色不盡，何妨四無記亦攝心不盡。問：既言四無記攝無記心不盡，未知借識是何無記？\n答：此借識心是自性無記。耳識非威儀，非威儀無記。上地無工巧，非工巧無記。變化唯在\n意，非變化無記。異熟非異地起，非異熟無記。以此故知，唯是自性。」\n",
"a3_kosa_205":"《頌疏》卷二八：「淨定有四種，謂即順退分，順住\n順勝進，順決擇分攝，如次順煩惱，自上地無漏。」\n",
"a3_kosa_206":"《大毗婆沙論》卷一六三：「頗有淨初靜慮，離染故\n得、離染故捨，退故得、退故捨，生故得、生故捨耶？答：得，從梵世殁生欲界時捨。乃至\n有頂，隨應亦爾。」有。謂順退分，初靜慮離欲界染時得，離梵世染時捨；起梵世纏退時得\n，起欲界纏退時捨；從上地殁生梵世時得，從梵世殁生欲界時捨。乃至有頂，隨應亦爾。」\n",
"a3_kosa_207":"識處：疑「無所有處」。\n",
"a3_kosa_208":"無伺有尋：疑「無尋唯伺」。\n",
"a3_kosa_209":"《俱舍論》卷二八：「中間靜慮與諸近分，爲無别義\n，爲亦有殊？義亦有殊。謂諸近分，爲離下染，是入初因，中定不然，復有别義。」\n",
"a3_kosa_210":"《順正理論》卷七八：「無三識身，故無樂受。無喜\n受者，已不共初，然於初貪未能離故。又由自勉功用轉故，由此説爲苦通行攝。非憂苦者，\n已出欲故。由此一向捨受相應。」\n",
"a3_kosa_211":"《大毗婆沙論》卷一○五：「問：何故此定不作非我\n行相耶？答：若見諸法非我不見爲空者，雖厭生死而非增勝，若見爲空則於生死厭力增勝。\n如人在道獨行，遇逢一伴，雖知非屬於己，而不大愁，後若别時，便極愁惱故。空行相於厭\n生死，勝於非我，由是此定，不作非我行相。」\n",
"a3_kosa_212":"《法藴足論》卷八：「云何光明定加行？修何加行，\n入光明定？謂於此定，初修業者，先應善取淨月輪相，或復善取淨日輪相，或復善取藥物末\n尼諸天宫殿星宿光明，或復善取燈燭光明，或復善取焚燒城邑川土光明，或復善取焚燒山澤\n曠野光明，或復善取焚燒十擔，或二十擔，或三十擔，或四十擔，或五十擔，或百擔，或千\n擔，或百千擔，或無量百擔，或無量千擔，或無量百千擔薪火光明，此火光明，熾盛極熾盛\n，洞然遍洞然，隨取一種光明相已，審諦思惟解了觀察勝解堅住，而分别之。彼於爾時，若\n心散亂，馳流餘境，不能一趣，不能守念，令住一緣，思惟所取諸光明相，齊此未名光明定\n加行，亦未名入光明定。彼若爾時攝録自心，令不散亂馳流餘境，能令一趣，住念一緣，思\n惟如是諸光明相，如是思惟，發勤精進，乃至勵意不息，是名光明定加行，亦名入光明定。」\n",
"a3_kosa_213":"《法藴足論》卷八：「善知受生，善知受住，善知受\n滅盡没者，謂審觀受生，審觀受住，審觀受滅盡没。於此住念非不住念者，謂審觀受生時，\n具念正知；審觀受住時，具念正知；審觀受滅盡没時，具念正知。及善知想善知尋者，謂審\n觀想尋生，審觀想尋住，審觀想尋滅盡没。於此住念非不住念者，謂審觀想尋生時，具念正\n知；審觀想尋住時，具念正知；審觀想尋滅盡没時，具念正知，是名修。」\n",
"a3_kosa_214":"恃相卅八法：恃我慢憍勝，無明顛倒始，煩惱諸行生\n，内慧行自照。初叚有十法，恃生恃種性，恃色恃財富，恃貴恃尊勝，恃豪族無病，恃年壯\n命壯，皆屬生身執，不可依作依。次叚十二法，恃工巧多聞，辯才得利養，得恭敬尊重，恃\n備足師範，恃徒衆黨侣，恃長宿恃力，皆從我所生。後叚十六法，恃神足禪定，恃無求知足\n，獨處阿練若，恃乞食糞掃，離荒食一受，恃冢間露處，樹下常端坐，隨坐但三衣（增），\n如是十六法，皆三學杜多，佛讚勝功德，不恃則爲妙，内慧行之基。（《基本三學》第三〇九頁）\n",
"a3_kosa_215":"《大毗婆沙論》卷八四：「問：何故名解脱，解脱是\n何義？答：棄背義是解脱義。問：若棄背故名解脱者，何等解脱，棄背何心？答：初二解脱\n棄背色貪心，第三解脱棄背不淨觀心，四無色處解脱，各自棄背次下地心，想受滅解脱棄背\n一切有所緣心，故棄背義是解脱義。」\n",
"a3_kosa_216":"《光記》卷二九：「有説第三，初於身色，以勝解力\n，取清淨相，後漸遣除，解脱成滿，緣身解脱此爲究竟，故偏於此立身證名。滅定無心唯依\n身住，故亦於彼立身證名。就勝故然，理實皆爾。」\n",
"a3_kosa_217":"《大乘義章》卷十三：「於外色中始觀一身以爲不淨\n，名外觀少，何故不多？龍樹釋言：學觀之始，畏心難攝，不敢多觀，譬如鹿遊未調，不可遠放。」\n",
"a3_kosa_218":"聲明：五明之一。《麟記》卷一：「言五明者，一者\n聲明，釋詞訓字，詮自流例。二工巧明，伎术機關，陰陽曆數。三醫方明，禁咒閉邪，藥石\n針艾。四因明，考定正邪，研窍真僞。五内明，究暢五乘，因果妙理。」\n",
"a3_kosa2_1":"《雜寶藏經》卷八，第九六經「佛弟難陀爲佛所逼出家得道緣」。\n",
"a3_kosa2_2":"《光記》卷一：「若於三藏，十二分教，受持讀誦，究竟\n流布，是生得慧。」\n",
"a3_kosa2_3":"見《清淨道論》第一「説戒品」。\n",
"a3_kosa2_4":"《頌疏》卷一：「五百羅漢既結集已，刻石立誓，唯聽自\n國，不許外方。敕藥叉神，守護城門，不令散出。然世親尊者，舊習有宗，後學經部，將爲\n當理，於有宗義懷取捨心。欲定是非，恐畏彼師，情懷忌憚，潛名重往。時經四載，屢以自\n宗，頻破他部。時有羅漢被詰莫通，即衆賢師悟入是也。悟入怪異，遂入定觀，知是世親，\n私告之曰：此部衆中未離欲者，知長老破，必相致害，長老可速歸還本國。於時世親至本國\n已，講毗婆沙。若一日講，便造一偈，攝一日中所講之義，刻赤銅葉，書寫此偈。如是次第\n，成六百頌，攝大婆沙，其義周盡。標頌香象，擊皷宣令云：誰能破者，吾當謝之。竟無一\n人能破斯偈。」\n",
"a3_kosa2_5":"《大唐大慈恩寺三藏法師傳》卷一：「法師既被停留，違\n阻先志，遂誓不食以感其心。於是端坐，水漿不涉於口三日。至第四日，王覺法師氣息漸惙\n，深生愧懼，乃稽首禮謝云：任師西行，乞垂早食。」\n",
"a3_kosa2_6":"見《長阿含經》卷十九「龍鳥品」。\n",
"a3_kosa2_7":"《麟記》卷一：「無漏上境煩惱雖緣，猶如炎石，足不隨\n住……如鹹鹵田，雖能生苗，不能增盛，名曰無苗。」\n",
"a3_kosa2_8":"《頌疏》卷一：「受能領納，餘心所法雖俱領境，唯受偏\n强，以自性是受故，獨得受名。如有十人同一處坐，一人是賊。傍忽有一人叫唤呼賊，十人\n雖復俱聞賊聲，實是賊者領則偏强。心心所法雖同領境，實是受者領亦偏强，故獨名受。」\n",
"a3_kosa2_9":"見《大唐西域記》卷九：「昔有外道欝頭藍子者，志逸煙\n霞，身遺草澤，於此法林栖神匿迹。既具五神通，得第一有定。摩揭陀王特深宗敬，每至中\n時，請就宮食。欝頭藍子凌虚履空，往來無替。摩揭陀王候時瞻望，亦既亦至已，捧接置座\n。王將出遊，欲委留事，簡擢中宮，無堪承命。有少息女，淑慎令儀，既親且賢，無出其右\n，摩揭陀王召而命曰：『吾方遠遊，将有所委，爾宜悉心，慎終其事。彼欝頭藍仙，宿所宗\n敬，時至來飯，如我所奉』。勅誡既已，便即巡覽。少女承旨，瞻候如儀，大仙至已，捧而\n置座。欝頭藍子既觸女人，起欲界染，退失神通，飯訖言歸，不得虚遊……步自王宮，至彼法林。」\n",
"a3_kosa2_10":"《頌疏》卷八：「等活地獄，謂彼有情，雖遭種種斫\n刺磨擣，而彼暫遇涼風所吹，尋蘇如本，等前活故，立等活名。」\n",
"a3_kosa2_11":"《頌疏》卷八：「黑繩地獄，先以黑繩，秤量支體，\n後方斬鋸，故名黑繩。」\n",
"a3_kosa2_12":"《頌疏》卷八：「衆合地獄，衆多苦具，俱來逼身，\n合黨相殘，故名衆合。」\n",
"a3_kosa2_13":"《頌疏》卷八：「號叫地獄，衆苦所逼，異類悲號，\n發怨叫聲，名爲號叫。」\n",
"a3_kosa2_14":"《頌疏》卷八：「大號叫地獄，劇苦所逼，發大哭聲\n，悲叫稱怨，故名爲大號叫。」\n",
"a3_kosa2_15":"《頌疏》卷八：「炎熱地獄，火隨身轉，炎熾周圍，\n熱苦難任，故名炎熱。」\n",
"a3_kosa2_16":"《頌疏》卷八：「極熱地獄，若内若外，自身他身，\n俱出猛火，互相燒害，熱中極故，名爲極熱。」\n",
"a3_kosa2_17":"《頌疏》卷八：「無間地獄者，受苦無間，或無樂間\n苦，故名無間。」\n",
"a3_kosa2_18":"《頌疏》卷八：「昔於此洲，有商人入海，得一雌鶴\n，形色偉麗，奇而悦之，遂生二卵。於後卵開，生二童子，端正聰明，年長出家，得阿羅漢\n果，大者名世羅，小者名鄔婆世羅。」\n",
"a3_kosa2_19":"見《頌疏》卷八。\n",
"a3_kosa2_20":"見《俱舍論頌疏集註》二四〇頁。\n",
"a3_kosa2_21":"見《百喻經》殺群牛喻。\n",
"a3_kosa2_22":"《頌疏》卷十四：「以損生身，成無間罪，故知佛身\n亦真佛體，故須歸依。」\n",
"a3_kosa2_23":"見《賢愚經》卷二「波斯匿王女金剛緣品」。\n",
"a3_kosa2_24":"見《雜寶藏經》卷一「慈童女緣」。\n",
"a3_kosa2_25":"《集註》六四八頁：「七方便（七賢）：五停心、别\n相念住、總相念住、煖、頂、忍、世第一。」\n",
"a3_kosa2_26":"《舊雜譬喻經》卷上（二七）：「昔有婦人，常曰：\n「我無所亡。」其子取母指鐶，擲去水中已，往問母金鐶所在。母言：「我無所亡。」母後\n日請目連、阿那律、大迦葉飯，時當得魚，遣人於市買魚歸治，於腹中得金鐶，母謂子：「\n我無所亡。」子大歡喜，往至佛所，問：「我母何因有此不亡之福？」佛言：「昔有一仙人\n居北，陰寒，至冬天，人人悉度山南。時有老獨母，貧窮不能行，獨止，爲衆蓋藏器物。春\n，人悉來還，母以物一一悉付還其主，衆人皆歡喜。」佛言：「時獨母者是汝母，前世護衆\n人物故，得是無所亡福耳。」」\n",
"a3_kosa2_27":"《寶疏》卷二一：「如世尊告憍尸迦言：由嫉、慳結，人天惱亂。」\n",
"a3_kosa2_28":"《瑜伽師地論》卷三二：「復應數數取光明相，謂或燈明\n，或大火明，或日輪明，或月輪明。」\n",
"a3_kosa2_29":"海公上師《現證莊嚴論文句頌解》「初聞般若理，内心數\n悦樂，喜極流涕淚，身毛作竪立。」\n",
"a3_kosa2_30":"《婆沙》卷六：「何故名頂？答：如山頂故。謂如山頂人\n不久住，若無諸難便過此山，更至餘山。若有諸難即還退下。如是行者，至頂位中必不久住\n，若無諸難便進至忍，若有諸難還退住煖。」\n",
"a3_kosa2_31":"《瑜伽論記》卷十九：「梵者，西國言，此翻爲寂靜，謂涅槃也。」\n",
"a3_kosa2_32":"事見《佛本行集經》卷三。\n",
"a3_kosa2_33":"見《太子須大拏經》。\n",
"a3_kosa2_34":"《俱舍論》卷十八：「天地此界多聞室，逝宫天處十方無\n，丈夫牛王大沙門，尋地山林遍無等。」\n",
"a3_kosa2_35":"見《過去現在因果經》卷二。\n",
"a3_kosa2_36":"見蕅益大師《阿彌陀經要解》。\n",
"a3_kosa2_37":"詳見《增壹阿含經》卷二九。\n",
"a3_kosa2_38":"見《頌疏》卷一。\n",
"a3_kosa2_39":"炰烋：通「咆哮」，自矜氣健之貌。\n",
"a3_kosa2_40":"頡頏：音xiéháng，鳥飛上下貌，引申為不相上下之意。\n",
"a4_wishi_1":"薄伽梵：《佛地經論》（唐玄奘譯）卷一：「如來名『薄\n伽梵』，其義云何？謂諸如來，永不繫屬諸煩惱故，具自在義；焰猛智火所燒煉故，具熾盛\n義；妙三十二大士相等所莊飾故，具端嚴義；一切殊勝功德圓滿無不知故，具名稱義；一切\n世間親近供養咸稱讚故，具吉祥義；具一切德常起方便利益、安樂一切有情無懈廢故，具尊貴義。」\n",
"a4_wishi_2":"四大種：《俱舍論》卷一：「大種謂四界，即地水火風，\n能成持等業，堅濕煖動性。」（地能成持用，水能成攝用，火能成熟用，風能成長用。）」\n",
"a4_wishi_3":"界：界者，能持地等自相及所造色，令其相似相續不絶。\n",
"a4_wishi_4":"等：等者，《對法》説二十二種觸，十一外，加軟、緩、\n急、飽、力、劣、悶、癢、黏、病、老、死、疲、息、勇。（《雜集論》卷一：「所觸一分\n者，四大種所造身根所取義。謂滑、澀、輕、重、軟、緩、急、冷、飢、渴、飽、力、劣、\n悶、癢、黏、病、老、死、疲、息、勇。此所觸一分由八因建立。謂相故、摩故、稱故、觸\n故、執故、雜故、界不平等故、界平等故。水風雜故冷，地水雜故黏，界平等故息、力、勇\n，勇者無畏飽，由二種界不平等故有飢等餘觸。」\n",
"a4_wishi_5":"《四十二章經》：「有沙門夜誦經，其聲悲緊，欲悔思返\n。佛呼沙門問之：汝處於家，將何修爲？對曰：常彈琴。佛言：弦緩何如？曰：不鳴矣。弦\n急何如？曰：聲絶矣。急緩得中何如？曰：諸音普調。佛告沙門：學道猶然，執心調適，道可得矣。」\n",
"a4_wishi_6":" 受：領納順、違、俱非境相爲性，起愛爲業。起愛\n爲業者，於順境未得起欣求欲，已得起不離欲；對違境，未得起不合欲，已得起乖離欲；於\n中庸境起不合不離欲。\n",
"a4_wishi_7":"想：於境取像爲性，施設種種名言爲。\n",
"a4_wishi_8":"遍行：周遍行起於一切心，具遍四一切爲所行故。一切性\n，善、惡、無記；一切地，有尋有伺等；一切時；一切八識心王心。\n",
"a4_wishi_9":"觸謂三和合，分别變異，令心心所觸境爲性，受想思等所\n依爲業。根等三法合和，即有相順生起心心所的功能（變異），觸心所承領似有（分别）這\n種變異功能，故名分别變。\n",
"a4_wishi_10":"是憶念義：想起應趣自所緣境。\n",
"a4_wishi_11":"謂能取境正因等相，駆役自心，令造善等。（窺基）\n",
"a4_wishi_12":"《成唯識論述記》卷二：「問曰：何故名自相共相？\n答曰：法自體唯證智知，言説不及，是自相；若法體性言説所及，假智所緣，是爲共相。」\n《成唯識論述記》卷二：「如五藴中，以五藴事爲自相，空無我等理爲共相……如是展轉至\n不可説爲自相，可説極微等爲共相，故以理推無自相體。且説不可言法體名自相，可説爲共\n相。以理而論，共既非共。自亦非自，爲互遮故，但各别説。説空無我等是共相者，從假智\n説。此但有能緣行解，都無所緣真實共體。\n",
"a4_wishi_13":"《成唯識論述記》卷二：「諸法之自體，唯證智可知\n而不可言喻者，是爲自相。而諸法之體性，爲假智所緣，且可藉言語可解者，是爲共相。」\n",
"a4_wishi_14":"《俱舍論頌疏》卷十八：「頌曰：將得忍不還，無學\n業爲障。釋曰：若從頂位將得忍位，感惡趣業，皆極爲障，以忍超彼異熟地故（地獄果是）\n。如人將離本所居國，一切債主，皆極爲障。若有將得不還果時，欲界繫業，皆極爲障，唯\n除隨順現法受業（以不還果，受欲現業，故除也）。若有將得無學果時，色無色業，皆極爲\n障，亦除順現。」\n",
"a4_wishi_15":"諸有：欲有、色有、無色有。\n",
"a4_wishi_16":"有資具：亦稱有具，能生三有。三資具即三有之因也。\n",
"a4_wishi_17":"無癡：於諸理事明解爲性，對治愚癡，作善爲業。\n",
"a4_wishi_18":"善品：斷惡、修善。\n",
"a4_wishi_19":"若被甲、若加行、若無怯弱、若不退轉、若無喜足：\n一、最初發起猛利樂欲，如戰士著鎧而後入陣。二、隨其所欲發起堅固勇悍之方便。三、爲\n證得所受諸法，不自輕蔑，亦無怯懼。四、堪忍寒熱等苦。五、對微劣善法不生喜足，欣求\n後後勝妙功德法，漸次悟入諦現觀等勝道。\n",
"a4_wishi_20":"輕安：遠離粗重，調暢身心，堪任爲性，對治昏沉，\n轉依爲業。輕安對治昏沉。調柔性（非粗獷），堪能性（非沉重）。粗獷沉重，故名粗重，\n即無所堪能的不調柔相，是粗重相。離重名輕，調暢名安，由離粗重，輕鬆安穩，故名輕安\n。言轉依者，令所依身心，去粗重、得安穩故。\n",
"a4_wishi_21":"於所斷惡防令不起，於所修善法，修令增長。\n《百法疏》：「耽著五欲，名爲放逸，遠離彼塵，名不放逸。」\n《增壹阿含經》：「云何爲無放逸行？所謂護心也。」\n《正理》：「專於己利，防身語意，放逸相違。\n《寶疏》：「己利即是三乘涅槃，及世愛果。」\n",
"a4_wishi_22":"無瞋翻對斷物命瞋，不害但違損惱物害；無瞋與樂，\n不害拔苦，爲顯慈悲二相别故，利樂有情彼二勝故，故依無瞋别立不害。\n",
"a4_wishi_23":"根本煩惱六。煩是擾義，惱是亂義，擾亂身心，使恒\n處生死，不得解脱，故名煩惱。\n",
"a4_wishi_24":"見《史記》卷九，吕太後本紀。\n",
"a4_wishi_25":"《俱舍論頌疏》卷二二：「若依經部宗，唯説貪愛爲\n集諦體，以經唯説貪愛爲集故。薩婆多云：經就勝故，説愛爲集，理實一切皆是集諦。」\n",
"a4_wishi_26":"瞋：於苦、苦具，憎恚爲性。苦即三苦，苦具即凡能\n生苦果的法皆是，即一切有漏法，及無漏法，如毁撥無漏、憎嫉滅道。\n",
"a4_wishi_27":"三摩地：等持，離掉舉云等，心不散亂云持。\n",
"a4_wishi_28":"三摩缽底：等至，由加行伏沉掉力，至其受位，身心安和也。\n",
"a4_wishi_29":"等：三摩呬多，等引，謂能引諸功德也。\n",
"a4_wishi_30":"貪等煩惱、隨煩惱業，能招後生雜染法故。\n",
"a4_wishi_31":"化生衆生：中有身。\n",
"a4_wishi_32":"種子任持作用：即託父親種子，母親能任持相續增長。\n",
"a4_wishi_33":"藴：五取藴。\n",
"a4_wishi_34":"執一切惡爲最勝，而又是能得涅槃清淨法的因，是見\n取相。若執非惡見外之餘法爲殊勝，能得涅槃，或但執爲殊勝，而不計爲能得涅槃清淨法之\n因，則屬邪見，非見取攝。\n",
"a4_wishi_35":"戒禁：性戒名戒，遮戒名禁。\n",
"a4_wishi_36":"七種惡：殺、盜、婬等身三口四。\n",
"a4_wishi_37":"僧佉：數論外道。\n",
"a4_wishi_38":"見《大毗婆沙論》卷一一四。\n",
"a4_wishi_39":"《四十二章經》：「佛言：惡人害賢者，猶仰天而唾\n，唾不污天，還污己身；逆風坋人，塵不污彼，還坋於身。賢者不可毁，禍必滅己也。」\n",
"a4_wishi_40":"誑：爲獲利譽，矯現有德，詭詐爲性。矯是不實。\n",
"a4_wishi_41":"諂：爲罔冒他，曲順時宜，矯設方便，以取他意；或\n藏己失，不任師友正教誨故；貪名利故，貪分：無智故諂，癡分。\n",
"a4_wishi_42":"不任教授：不任師友正教誨。\n",
"a4_wishi_43":"恃：《舍利弗阿毗曇論》卷十八：「何謂恃生？衆生\n貴生，以生自高，以生爲境界，若心憶念，謂生妙好，而以自高，是名恃生。復次恃生，我\n生勝彼中生，彼生卑，世間諸生中我生最勝。衆生重於生，常敬於生，若心憶念諸生妙好，\n而以自高，是名恃生。恃姓、恃色、恃財貴、恃尊勝、恃豪族、恃無病、恃年壯、恃命壯、\n恃工巧、恃多聞、恃辯才、恃得利養、恃得恭敬、恃尊重、恃備足、恃師範、恃徒衆、恃黨\n侣、恃長宿、恃力、恃神足、恃禪、恃無求、恃知足、恃獨處、恃阿蘭若、恃乞食、恃糞掃\n衣、恃我能離荒食、恃一受食、恃冢間、恃露處、恃樹下、恃常端坐、恃隨敷坐、恃但三衣\n，亦如上廣説。」\n",
"a4_wishi_44":"憍：於自盛事，深生染著，醉傲爲性，能障不憍，染\n依爲業，由是生長一切雜染法故。《俱舍論》：憍由染自法，慢對他心舉。\n",
"a4_wishi_45":"財等：等法，資具、榮位皆名爲財，教、理、行、果皆名爲法。\n",
"a4_wishi_46":"能障輕安、毗缽舍那爲業。\n",
"a4_wishi_47":"《百法解》卷二：「能障行捨、奢摩他爲業。」\n",
"a4_wishi_48":"《百法解》卷二：「能障正念，散亂所依爲業。」「\n此失念者，有云念一分攝，是煩惱相應念故；有云癡一分攝，《瑜伽》説此是癡分故，癡令\n念失，故名失念；有云俱一分攝，由前二文影略説故。」\n",
"a4_wishi_49":"令心心法於所緣境流散爲性。\n",
"a4_wishi_50":"《百喻經》卷二：「昔有一人，有二百五十頭牛，常\n驅逐水草，隨時餧食。時有一虎，噉食一牛，爾時牛主即作念言：『已失一牛，俱不全足，\n用是牛爲？』即便驅至深坑高岸，排著坑底，盡皆殺之。凡夫愚人亦復如是，受持如來具足\n之戒，若犯一戒，不生慚愧清淨懺悔，便作念言：『我已破一戒，既不具足，何用持爲？』\n一切都破，無一在者，如彼愚人盡殺群牛無一在者。」\n",
"a4_wishi_51":"昧略：昧簡在定，略别寤時。\n",
"a4_wishi_52":"能與過失所依爲業：障觀爲業。\n",
"a4_wishi_53":"思慧差别：思慧一分爲體。\n",
"a4_wishi_54":"心不相應行：《俱舍論頌疏》卷四：「體非心所，不\n與心相應，名心不相應，五藴門中是行藴攝，故名心不相應行。」\n",
"a4_wishi_55":"等：心所。\n",
"a4_wishi_56":"一、種子成就，有情身中具有一些法潛在功能。二、\n自在成就，依禪定神通等勢力成就自在轉變的力量。三、現行成就，正成就之一切現行法。\n三種成就中，前二唯種子，後一唯現行。\n",
"a4_wishi_57":"見《大唐西域記》卷九。\n",
"a4_wishi_58":"無想定屬第四禪廣果天，體是有漏，唯外道修。有類\n外道以想爲生死根源，妄計想滅，得入涅槃。《成唯識論》：想滅爲首，立無想名，令身安\n和，故亦名定。\n",
"a4_wishi_59":"遍淨：第三禪。\n",
"a4_wishi_60":"見《中阿含經》卷五十六。\n",
"a4_wishi_61":"滅盡定：三果以上聖者，以有頂非非想處爲所依地，\n無漏心引起，故體是無漏。\n",
"a4_wishi_62":"衆同分：衆是種類義，同是一義，分是相似義。依有\n情身心相似分位差别，假立同分。實亦通於外法。《俱舍論頌疏》卷五：「同分有情等。同\n謂諸有情身形、業用、樂欲展轉互相似故。分者因義，謂由此分，能令有情身形等同。同之\n分故，名爲同分，依主釋也。」\n",
"a4_wishi_63":"名身：一名稱名，二名曰名身，三名以上名多名身。\n",
"a4_wishi_64":"意：意處。\n",
"a4_wishi_65":"集起名心，積集名心，思量名意，了别名識。\n",
"a4_wishi_66":"世間：《瑜伽》始從欲界，乃至有頂，諸薩迦耶，皆\n名世間。又三世。《俱舍論》此有漏法，亦名世間。\n",
"a4_wishi_67":"相續：《瑜伽師地論》卷一○○：「立四相續，一自\n身相續，二他身相續，三諸根相續，四境界相續。」《婆沙》卷一九二：「相續有五：一中\n有相續，二生有相續，三分位相續，四法相續，五刹那相續。」（分位相續謂胎内外各五位相續也。）\n",
"a4_wishi_68":"意界：《顯揚聖教論》卷一：「或欲顯此（末那識）\n與彼意識爲近所依故（意根增上緣）。如薄伽梵説，内意處不壞，外法處現前，及彼所生作\n意正起，如是所生意識得生。意識者，謂從阿賴耶識種子所生（因緣），依於意根，與彼俱\n轉，緣一切共不共法爲境，了别爲性。」======\n",
"a4_wishi_69":"三相義即「三性」：《顯揚》卷一：「如是五法，復有三\n相應知，一、增益相，二、增益所起相，三、法性相。增益相者，謂諸法中遍計所執自性。\n增益所起相者，謂諸法中如其所應依他起性。法性相者，謂諸法中圓成實性。」\n",
"a4_wishi_70":"見《婆藪槃豆法師傳》，陳真諦譯。\n",
"a4_wishi_71":"斯皆心分也：《俱舍論頌疏》卷四：「心意識體一，心心\n所有依，有緣有行相，相應義有五。集起名心，謂能集起三業事也；思量名意；了别名識。\n復有釋言：淨不淨界，種種差别，故名爲心。即此爲他作所依止，故名爲意。即此者，即此\n心也。將所依義釋意也。作能依止，故名爲識，識能依意也。」\n",
"a4_wishi_72":"《俱舍論頌疏》卷四：「心意識體一，心心所有依，有緣\n有行相，相應義有五。心心所五義平等，故説相應。一所依，二所緣，三行相，四時，五事\n，皆平等故。事者體也，一相應中，如心體一，諸心所法，各各亦爾。」\n",
"a4_wishi_73":"能所造八法：《俱舍論頌疏》卷四：「欲微聚無聲，無根\n有八事。八事者，謂四大種、色香味觸。」\n",
"a4_wishi_74":"於實、德、能，深忍樂欲，心淨爲性：忍即勝解，信之因\n也。樂欲即欲心所，信之果也。心淨即信心所，信之自相。\n信實——實即四聖諦理，此諦理是真實不虛，深信不疑。\n信德——三寶殊勝功德，世出世間一切有爲無爲功德，信其確有。\n信能——信三寶有與樂拔苦功能，依之修行，自己也能成就此種功能。\n",
"a4_wishi_75":"《雜集論》卷十：「欲爲精進依，信爲欲因。所以者何？\n由欲求故，爲得此義發勤精進，如是欲求不離信受。」《瑜伽師地論略纂》卷八：「信爲欲\n因，義曰其欲精進時不離信，信念在初。」\n",
"a4_wishi_76":"無著：知生死過，深生厭患。\n",
"a4_wishi_77":"有：三有異熟果。\n",
"a4_wishi_78":"有具：中有、煩惱、業及器世間等三有之因。\n",
"a4_wishi_79":"德：法。\n",
"a4_wishi_80":"有德：人。\n",
"a4_wishi_81":"《顯揚聖教論》卷五：「雜染義者，有三種，於三界\n中，煩惱雜染、業雜染、生雜染。」\n《瑜伽師地論》卷七十七：「雜染義者：謂三界中三種雜染，一者煩惱雜染，二者業雜染，\n三者生雜染。」《品類足論》卷六：「雜染法云何？謂有漏法。」\n",
"a4_wishi_82":"《大乘五蘊論》：「諸煩惱中，後三見及疑唯分别起\n，餘通俱生及分别起。」\n《成唯識論》卷六：「如是總别十煩惱中，六通俱生及分别起，任運思察俱得生故；疑後三\n見唯分别起，要由惡友或邪教力自審思察方得生故。」\n",
"a4_wishi_83":"瞢：目不明也。\n",
"a4_wishi_84":"《大乘百法明門論疏》（普光）卷二：「不定四數中\n，睡眠、惡作亦言是愚癡分，亦有别體。謂睡眠用想、欲爲性，離想外無别體故。故《顯揚\n論》言：『夢者欲、想所作，此亦多虛。』故知睡眠是欲、想性，謂是癡分，雖離癡外有别\n體，然是欲想性故，當知亦是假立。」\n《顯揚聖教論》卷六：「雖於夢中少見實相。此亦欲、想所作。又衆緣現前令處夢者少有所\n見。此亦多虛。」\n",
"a4_wishi_85":"《大乘百法明門論疏》（普光）卷二：「不定四數中\n，睡眠、惡作亦言是愚癡分，亦有别體。謂睡眠用想欲爲性，離想外無别體故……惡作無文\n。但西國諸師相傳云：或是慧，雖言癡分，離癡外有别體，然是思是慧性，離思慧外，無别\n體故，故知亦是假立。」\n",
"a4_wishi_86":"大造：大種、所造色。\n",
"a4_wishi_87":"此四全：極逈、極略、受所引、遍計所執，四種也。\n",
"a4_wishi_88":"一少分是假，一分乃實：定果色異生所變，唯令他見\n，不堪受用；定果色聖者所變，能成實用，極殊勝故。\n",
"a4_wishi_89":"五性：一、聲聞乘定性，二、獨覺乘定性，三、如來\n乘定性，四、不定種性，五、無種性，即所謂無性闡提，法爾不具無漏種子，唯具有漏種，\n不能解脱生死，但得修習世間善業，得人天善果。\n",
"a4_wishi_90":"異生性：三界異類有情，妄執種種異見，而受五趣生死。\n",
"a4_wishi_91":"二障：煩惱、所知。若論正障，煩惱障障生空，所知\n障障法空。若論兼障，則互通彼此。復次執我執法薩迦耶見，體無有異，同一種生，現行見\n分，亦復同一，但以義用有别，故分為二。\n",
"a4_wishi_92":"無爲：恒有。\n",
"a4_wishi_93":"《俱舍論頌疏》卷十二：「頌曰：三災火水風，上三\n定為頂，如次内災等，四無不動故。然後器非常，情俱生滅故，要七火一水，七水火後風。\n釋曰：三災火水風者，此大三災逼有情類，令捨下地集上天宮……如次内災等者，謂初靜慮\n尋伺為内災，能燒煩惱心，等外火災故。第二靜慮喜受為内災，與輕安俱潤身如水，等外水\n災故。第三靜慮動息為内災，息即是風，等外風災故。」\n",
"a4_wishi_94":"《百法明門論解》：「大乘者是能詮教，唯聲名句文\n四法，故劣。百法乃所詮事理，通一百法，故勝。將勝就劣，以劣顯勝，云大乘之百法，依\n士釋也。又百法是所緣，乃舉全數故勝，明是能緣之慧，即别境五中之一法耳，故劣。將劣\n就勝，以勝顯劣，云百法之明,依主釋也。」\n《俱舍光記》云：「依主依士，名異義同。」與基師義不悖，而《宗鏡録》等，則全同基師\n也。據此則文中「若據此言」至「恐非正義也」四句，刪之爲佳。\n",
"a4_wishi2_1":"《攝大乘論》（玄奘法師譯）卷一：「此中最初且説所知\n依即阿賴耶識。世尊何處説阿賴耶識名阿賴耶識？曰：由攝藏諸法，一切種子識，故名阿賴\n耶，勝者我開示。」\n",
"a4_wishi2_2":"《中論》卷四：「衆因緣生法，我説即是空，亦爲是假名\n，亦是中道義，未曾有一法，不從因緣生，是故一切法無不是空者。」\n",
"a4_wishi2_3":"《攝大乘論世親釋》卷四：「論曰：此中何者依他起相？\n謂阿賴耶識爲種子，虚妄分别所攝諸識。此復云何？謂身、身者、受者識、彼所受識、彼能\n受識、世識、數識、處識、言説識、自他差别識、善趣惡趣死生識。此中若身、身者、受者\n識、彼所受識、彼能受識、世識、數識、處識、言説識，此由名言熏習種子；若自他差别識\n，此由我見熏習種子；若善趣惡趣死生識，此由有支熏習種子。由此諸識，一切界趣雜染所\n攝依他起相虚妄分别皆得顯現。如此諸識，皆是虚妄分别所攝，唯識爲性，是無所有，非真\n實義顯現所依。如是名爲依他起相。」\n",
"a4_wishi2_4":"分河飲水：《梵網菩薩戒經義疏發隱事義》卷一：「分河\n異幟：西域性相二宗分河飲水，異色立幟。」\n《百法明門論論義》卷一：「及佛滅後，弘法菩薩解釋教義，依唯心立性宗，依唯識立相宗\n，各竪門庭，甚至分河飲水。而性相二宗不能融通，非今日矣。」\n",
"a4_wishi2_5":"《衆經目録》卷二：「唯識論一卷（唯識無境界十九紙）\n，後魏世瞿曇留支譯；唯識論一卷（修道不共他十一紙），陳世真諦譯；唯識二十論一卷（\n九紙），唐世玄奘譯。右三論同本異譯。」\n",
"a4_wishi2_6":"見《俱舍論頌疏集註》卷一，上海古籍出版社，二〇一四年，二〇頁。\n",
"a4_wishi2_7":"《大唐大慈恩寺三藏法師傳》卷三：「印度梵書，名爲記\n論，其源無始，莫知作者。每於劫初，梵王先説，傳授天人。以是梵王所説，故曰梵書。其\n言極廣，有百萬頌，即舊譯云毗伽羅論者是也……此翻名爲聲明記論，以其廣記諸法能詮，\n故名聲明記論。昔成劫之初，梵王先説，具百萬頌。後至住劫之初，帝釋復略爲十萬頌。其\n後北印度健馱羅國婆羅門睹羅邑波膩尼仙又略爲八千頌，即今印度現行者是也。」\n",
"a4_wishi2_8":"《大唐大慈恩寺三藏法師傳》卷三：「和上（戒賢論師）\n昔患風病，每發，手足拘急如火燒刀刺之痛，乍發乍息，凡二十餘載。去三年前，苦痛尤甚\n，厭惡此身，欲不食取盡。於夜中夢三天人，一黄金色，二琉璃色，三白銀色，形貌端正，\n儀服輕明，來問和上曰：『汝欲棄此身耶？經云：説身有苦，不説厭離於身。汝於過去曾作\n國王，多惚衆生，故招此報。今宜觀省宿愆，至誠懺悔，於苦安忍，勤宣經論，自當銷滅。\n直爾厭身，苦終不盡。」「當依我語，顯揚正法，瑜伽論等，遍及未聞，汝身即漸安隱，勿\n憂不差。有支那國僧樂通大法，欲就汝學，汝可待教之。』法藏聞已，禮拜報曰：『敬依尊\n教。』言已不見。自爾已來，和上所苦瘳除。」\n",
"a4_wishi2_9":"玄奘法師以舊譯《大般若經》零星不全，且多漏誤，時徒\n衆又「更請委翻」，乃決心重譯。但此經卷帙浩繁，住在京師，每苦事務紛繁，不能專心譯\n經，兼以近年疾病侵尋，體力衰邁，請求距離京師較近而僻靜之玉華寺，致力譯經，時年六\n十。玉華宫，在坊州宜君縣北四里（今陝西省延安宜君縣西南四十里處），貞觀二十一年七\n月建，第二年二月完竣，永徽二年九月三日詔廢玉華宫爲寺，寺内有肅成殿、雲光殿、明月\n殿、嘉壽殿、慶福殿、八桂亭諸名勝。\n",
"a4_wishi2_10":"命旌厥趣：命（窺基）闡揚其理趣。\n",
"a4_wishi2_11":"提訓：親提撕其耳，而教誨也。\n",
"a4_wishi2_12":"玄源見壅而無披：「玄源」指佛語本懷；菩薩深義，\n由此壅蔽而無法揭開。\n",
"a4_wishi2_13":"幽靈守昏而永翳：在沉淪中衆生因此常處昏迷而不能明悟。\n",
"a4_wishi2_14":"見《俱舍論頌疏集註》卷二九，第一〇七一—一〇七二頁。\n",
"a4_wishi2_15":"七處八會，謂説《華嚴經》也。此指晋譯《六十華嚴\n》，若唐譯《八十華嚴》有七處九會。\n",
"a4_wishi2_16":"三時教：《成唯識論述記》卷一：「如來設教隨機所\n宜，機有三品不同，教遂三時亦異。」\n法相宗所立有空中之三時教：一、第一時教，佛成道最初爲破外道凡夫實我之執，説四大五\n藴等諸法之實有而明人我之爲空無，四阿含等之小乘經是也。二、第二時教，佛復爲破小乘\n衆實法之執，説一切諸法皆空之理，即諸部之般若經是也。三、第三時教，佛更爲並破菩薩\n之空執與小乘之有執，説心内之法非空，心外之法非有，而明非空非有之中道，深密、法華\n等之諸經是也。以前二時教，爲佛説之方便，以第三時教，爲佛説之真實。又：詮一切有之\n教爲第一時教，詮空之教爲第二時教，詮中之教爲第三時教。詳見《成唯識論了義燈》。\n",
"a4_wishi2_17":"《成唯識論》卷二：「有情本來種姓差别，不由無漏\n種子有無，但依有障無障建立。如《瑜伽》説：『於真如境，若有畢竟二種障者，立爲不般\n涅槃法性。若有畢竟所知障種，非煩惱者，一分立爲聲聞種姓，一分立爲獨覺種姓。若無畢\n竟二種障者，即立彼爲如來種姓。』」\n",
"a4_wishi2_18":"《金剛經》：「須菩提！於意云何？如來有所説法不\n？」須菩提白佛言：「世尊！如來無所説。」「須菩提！汝勿謂如來作是念：『我當有所説\n法。』莫作是念，何以故？若人言『如來有所説法』，即爲謗佛，不能解我所説故。須菩提\n！説法者，無法可説，是名説法。」\n",
"a4_wishi2_19":"法詞二無礙解，境有差别等：《成唯識論》卷九：「\n法無礙解，即於能詮總持自在，於一名、句、字中，現一切名、句、字故……詞無礙解，即\n於言音，展轉訓釋，總持自在，於一音聲中，現一切音聲故。」\n《成唯識論》卷二：「然依語聲分位差别而假建立名句文身。名詮自性，句詮差别，文即是\n字，爲二所依。此三離聲，雖無别體，而假實異，亦不即聲。由此法詞二無礙解，境有差别。」\n",
"a4_wishi2_20":"《大般涅槃經》卷五（曇無讖譯）：「無信之人，名\n一闡提」「何等名爲一闡提耶？一闡提者，斷滅一切諸善根本，心不攀緣一切善法，乃至不\n生一念之善。」卷一九：「一闡提者，不信因果，無有慚愧，不信業報，不見現在及未來世\n，不親善友，不隨諸佛所説教誡。如是之人，名一闡提，諸佛世尊所不能治。」\n",
"a4_wishi2_21":"《入楞伽經》卷二：「一闡提者，無涅槃性。何以故\n？於解脱中不生信心，不入涅槃。\n",
"a4_wishi2_22":"《成唯識論》卷九：「由數修習無分别智，斷本識中\n二障粗重，故能轉捨依他起上遍計所執，及能轉得依他起中圓成實性。由轉煩惱，得大涅槃\n；轉所知障，證無上覺。」\n",
"a4_wishi2_23":"該師認爲佛智有見無相，佛之見分親了他心，名他心\n智。詳見後文「丁七 釋外難不照他心智，識不成失」中的無漏他心智。\n",
"a4_wishi2_24":"《華嚴經》卷一九：「若人欲了知，三世一切佛，應\n觀法界性，一切唯心造。」《十地論》卷八：「經曰：是菩薩作是念，三界虚妄，但是一心\n作。論曰：但是一心作者，一切三界唯心轉故。」\n",
"a4_wishi2_25":"《成唯識論疏抄》卷十二：「疏云：又經部師執無色\n心乃至故説三界唯心者。無色心者即是無體法。其無體法即名無體無實。此無法是心之所取\n。經部許無色界心亦緣無法。無法是能緣心之所法。恐此經部執此無法是心外别有故，今大\n乘云：此無法既名法，即此無法亦不離心。」\n",
"a4_wishi2_26":"見大正藏第四十三册，981頁上26-28。\n",
"a4_wishi2_27":"《楞嚴經》卷五：「菩薩修習水觀入三摩地，觀於身\n中水性無奪。初從涕唾，如是窮盡津液、精血、大小便利。身中漩澓，水性一同，見水身中\n與世界外浮幢王刹諸香水海等無差别。（月光童子）我於是時，初成此觀，但見其水，未得\n無身，當爲比丘室中安禪。我有弟子，窺窗觀室，唯見清水遍在屋中，了無所見。」\n",
"a4_wishi2_28":"《大乘唯識論》（陳真諦譯）：「於大乘中立三界唯\n有識。如經言：佛子，三界者唯有心，心、意、識等是總名，應知此心有相應法，唯言者爲除色塵等。」\n",
"a4_wishi2_29":"《仁王護國般若波羅蜜多經》卷一：「心行處滅，言\n語道斷；同真際，等法性。」\n",
"a4_wishi2_30":"《俱舍論頌疏》卷二四：淨道沙門性者，謂諸無漏道\n，名爲淨道。此之淨道，是沙門性；懷此道者，名爲沙門。沙門此云勤息，謂無漏道，以能\n勤勞息煩惱故。」\n",
"a4_wishi2_31":"《成唯識論述記》卷三：「論曰：了謂了别，即是行\n相，識以了别爲行相故。述曰：此解行相。識自體分以了别爲行相故。行相，見分也，類體\n亦然。相者，體也，即謂境相。行於境相，名爲行相。或相謂相狀，行境之相狀名爲行相。」\n",
"a4_wishi2_32":"六七因中轉，五八果上圓：《成唯識論證義》卷十：\n「問：妙觀察智何位現起？答：由第六識因中分别我執續諸生死，故見道時，斷分别障種，\n生空智果，方得現起；自見道後，即用此智，斷盡俱生，名無學位，以二乘人不斷所知，無\n法空智故。若菩薩於加行位終，初見道時，此智亦起，或從二地已上，入無漏觀，及入滅盡\n定，此智皆起。若法空觀智，菩薩見道時，斷盡分别法執種，及斷俱生一分法執，現起一分\n無分别智，從後二地，展轉而上，除有漏觀，生空智果，及入滅定，此智皆容現起。此上六\n七二智，因中皆轉，非如鏡智與成所作智，必解脱道方得轉故。故曰：六七因中轉，五八果上圓。」\n",
"a4_wishi2_33":"《俱舍論頌疏》卷二：「傳説分别，略有三種：一自\n性分别，二計度分别，三隨念分别。由五識身雖有自性而無餘二。論云：如一足馬名爲無足\n，是故經中説無分别。自性分别者，體唯是尋。」另，有人認爲「尋伺亦五識俱」，也有人\n認爲「五識定無尋伺」，詳見《成唯識論》。\n",
"a4_wishi2_34":"《攝大乘論無性釋》卷一：「又如大般若波羅蜜多經\n中説：慈氏，於汝意云何？諸遍計所執中，非實有性，爲色非色？不也，世尊。諸依他起中\n，唯有名想施設言説性，爲色非色？不也，世尊。諸圓成實中，彼空無我性，爲色非色？不\n也，世尊。慈氏，由此門故，應如是知，諸遍計所執性決定非有，諸依他起性，唯有名想施\n設言説，諸圓成實，空無我性，是真實有。」\n",
"a4_wishi2_35":"見《大乘唯識論》，陳真諦三藏譯。\n",
"a4_wishi2_36":"大正藏作「此言現識，非謂此識，若説此識者，非此\n處亦生。然今且爲處定比量，此識不生，例生比量，義准知。」\n",
"a4_wishi2_37":"通「少」。\n",
"a4_wishi2_38":"《因明入正理論疏》卷中：「凡因明法，所能立中，\n若有簡别，便無過失。若自比量以許言簡，顯自許之，無他隨一等過；若他比量，汝執等言\n簡，無違宗等失；若共比量等，以勝義言簡，無違世間、自教等失。」\n",
"a4_wishi2_39":"在唯識宗論典中，「捺落迦」專指地獄器間，「那落\n迦」專指地獄有情。\n",
"a4_wishi2_40":"烏駁狗：《爾雅》云：駁，獸名，駁如馬，倨牙，食虎豹。\n",
"a4_wishi2_41":"鐵巂：《俱舍論》作鐵嘴鳥，探啄有情眼睛、心肝，\n爭競而食。巂音「西」。\n",
"a4_wishi2_42":"大正藏作「等取剛鐵樹林刺等蠰狗吒蟲」。蠰狗吒蟲\n《俱舍論》作娘矩吒蟲，嘴尖如針，鑽皮破骨，咂食其髓。\n",
"a4_wishi2_43":"所立不成：喻有十過，此似同法喻過中之第二也。謂\n同喻雖與因法相合，而與宗法不合，從而失去助成作用之過失，如：聲常（宗），無質礙故\n（因）如覺（喻）。覺有無質礙因法，然無宗法常住性，以一切覺皆無常故。\n",
"a4_wishi2_44":"《俱舍論》卷十一：「如彼頌言：心常懷忿毒，好集\n諸惡業，見他苦欣悦，死作琰魔卒。琰魔王使諸羅刹娑擲諸有情置地獄者，名琰魔卒，是實\n有情，非地獄中害有情者。故地獄卒，非實有情。」\n",
"a4_wishi2_45":"龍藏、大正藏都作「有熏習識，汝便不許有果轉變」。\n",
"a4_wishi2_46":"川俚。\n",
"a4_wishi2_47":"《成唯識寶生論》卷三：「謂欲調伏一類有情，是故\n佛言有化生有情，是密意説也。謂彼斷見所害有情，隨自樂爲者，無後世者，無善惡因果者\n，爲欲洗除此之惡見，是故説心相續不斷。心相續言顯當生故。此死彼生，由斯理故，相續\n不斷，説有化生，是爲密意。離識之外，更無别我。」\n",
"a4_wishi2_48":"或斷者，轉識中前六識有間斷，第七識滅盡定時斷。\n或隱者，第七識無始以來一味任運而轉，一類内執，不假外緣故。轉，謂轉變生起，即知六\n識從根境生，待緣而起，故無主宰，不得自在，即無有我，以無根境，識不生起，生已還滅，不常住故。\n",
"a4_wishi2_49":"《俱舍論頌疏》卷九：「有業有異熟，作者不可得，\n謂能捨此藴，及能續餘藴，唯除法假。法假謂何？依此有故彼有，依此生故彼生。廣説緣起\n。解云：十二緣起假立於我，名爲法假也。」\n",
"a4_wishi2_50":"八種者，謂我、有情、意生、摩納縛迦、養育者、數\n取趣、命者、生者（此説世間「我」種種相，合有八種也）。摩納縛迦，譯爲儒耄，年少人\n、長者。《大日經疏》曰：「是毗紐天外道部類，正翻應爲勝我。」\n",
"a4_wishi2_51":"《俱舍論頌疏》卷一：「論云：何故世尊於所知境，\n由藴等門，作三種説？頌曰：愚根樂三故，説藴處界三。釋曰：所化有情，有三品故，世尊\n爲説藴等三門。愚有三者。或愚心所，總執爲我，爲説五藴。以五藴中，一藴是色，一藴是\n心，分心所法爲受想行三藴，故説五藴，能破彼執。或唯愚色，總執爲我，爲説十二處。以\n十二處中，十處是色，唯意法非色，故説處門，能破彼執。或愚色心，總執爲我，爲説十八\n界。以十八界廣説色心，十界是色，餘八是心，故説界門，能破彼執。根亦三者，謂上中下\n根。上根聰利，説略便解，爲開五藴；中根稍遲，説處方解；下根最鈍，要須廣説，故爲談\n界。樂亦三者，爲樂略中及廣文故，如其次第，説藴等三。」\n",
"a4_wishi2_52":"《成唯識論》卷四：「彼頌意説，世尊爲成十二處故\n，説五識種爲眼等根，五識相分爲色等境。故眼等根即五識種。」《成唯識論述記》卷四：\n「自種生者，此師意説，見分、相分俱名自種。下准此釋。自有三種：一因緣自，即見分種\n；二所緣緣自，即相分種（此二下文，並有自義）；三增上緣自，能感五識之業種也。」\n",
"a4_wishi2_53":"《大乘唯識論》（陳真諦譯）：「識自種子生，顯現\n起似塵，爲成内外入，故佛説此二。此偈欲顯何義？似塵識從自種子勝類變異生，是種子及\n似塵顯現爲似色識生方便門，故佛世尊次第説眼入色入，乃至似觸識從自種子至變異差别生\n。是種子及似觸顯現爲觸識生方便門，故佛世尊説爲身入及觸入。」\n",
"a4_wishi2_54":"大正藏作「此種由境界等諸緣合已」。\n",
"a4_wishi2_55":"大正藏作「緣青黄等種種行相」。\n",
"a4_wishi2_56":"《成唯識論》卷四：「彼頌意言，異熟識上能生眼等\n色識種子，名色功能，説爲五根，無别根等。種與色識常互爲因，能熏與種，遞爲因故。」\n《成唯識論述記》卷四：「彼觀所緣頌中，意説第八識上有生眼等色識種子，不須分别見分\n、相分，但總言説，由現行識，變似色塵等，故説此識名爲色識。即此種子，名眼等根，能\n生現識故。生色識故，名色功能。言内色根，非體是色，故説現識，名爲色識。又見分識，\n變似色故，名爲色識；或相分識，不離色故，名爲色識。或相分名色，見分名識，此二種同\n故，名色識種子。」\n",
"a4_wishi2_57":"十二處教：經説眼根不壞，色境現前，作意正起，有\n眼識生；乃至意根不壞，法境現前，作意正起，有意識生。\n",
"a4_wishi2_58":"法無我：中觀宗主張一切法無自性；此云非諸佛境離\n言法性亦都無故，名法無我。此二宗之不同處。\n",
"a4_wishi2_59":"《大智度論》卷五四：「須菩提所説般若波羅蜜，畢竟\n空義，無有定相，不可取，不可傳譯得悟；不得言有，不得言無，不得言有無，不得言非有\n非無，非非有非非無亦無，一切心行處滅。言語道斷故。」\n",
"a4_wishi2_60":"鼠唧鳥空：《四教儀集解》卷三：「我等愚輩，纔聞\n即空，便廢修行，不知即之所由。鼠唧鳥空，廣在經論，尋之思之。『我等』下牒計，重斥\n鼠唧鳥空者，斥其闇證，不達諦理，謬説即名，何殊怪鼠作唧唧聲，即聲無旨，濫擬生死即\n是涅槃；亦如怪鳥，作空空聲，空聲無旨，豈得濫同空空三昧。是以天台約理即一法叵存，\n約修則萬行圓足，全修在性，全性起修，性無所移，修常宛爾。若得此意，聞衆怪説，情慮\n坥然，圓頓妙乘，投心有地，良由了知本性空寂，故修衆行無有滯焉。」======\n",
"a4_wishi2_61":"《光記》卷十二：「七極微爲一微量，微顯細聚，梵云阿\n耨，此名微。眼見色中，最微細也，應知但爲天眼、輪王眼、後有菩薩眼所見。」\n",
"a4_wishi2_62":"和集：《成唯識論述記》卷二：「此第四，敘衆賢論師新\n薩婆多義，爲前非破色等法。極微是緣非所緣，以五識上無彼相故，便救之言：其五識上，\n亦有極微相。色等雖有多相，一分是現量境，此諸極微，共和集時，展轉相資，各有粗相生\n。如阿拏色七極微相資，皆有阿耨色許大微相。如經部師阿耨色是假法，薩婆多云彼和合故\n，非五識境，五識必依實法生故。今者所説，此相相資，各别極微，能生五識。一處相近名\n和，不爲一體名集。即是相近，體各别故，是實法故，有力生識；以相粗故，識有此相。故\n所緣緣理具足有。」\n",
"a4_wishi2_63":"眼根等，五識不取：《成唯識論》卷一：「然眼等根，非\n現量得，以能發識，比知是有，此但功能，非外所造。」《成唯識論述記》卷二：「雖第八\n識緣，及如來等緣，是現量得，世不共信，餘散心中，無現量得……此非他心及凡六識現量\n所得，唯除如來。」\n",
"a4_wishi2_64":"非形别故别，形别非實故：非形别故，覺彼瓶等之識上有\n差别相，形别唯在瓶等假法上有，非極微上有形别故，五識不緣假法故。\n",
"a4_wishi2_65":"《成唯識論述記》卷二：「極微等者，是相似義，且如俱\n以一俱胝極微作瓶甌，瓶甌應無别，以極微頭數相資等故，今既瓶甌，二相各别，故知不是\n相資量等爲五識緣……彼若救言：此瓶甌等，微量既齊，相資相應等，但由行位不同，遂令\n見别……今難之云：共和集位，一一極微應捨根本極微圓相，行位既别，相資亦殊，即是極\n微失本圓相……極微本是團圓之相，今既不爾，故失本相。由此又解，既無方分，如何行位\n，令其相别，相别唯在假瓶等上，非極微故。此亦非由行位異，令見異也。」\n",
"a4_wishi2_66":"江西本無「理趣」二字，今依大正藏增入。\n",
"a4_wishi2_67":"今以理通，令有方分：大正藏作「今以理逼，合有方分」。\n",
"a4_wishi2_68":"第三難，外境是一，象於其中，應至全境，無不到處，境\n是一故，無有此至彼不至之差别，馬亦如是。如是則象所至境，亦馬所至，於一境處，象馬\n相融，和合成爲一體，不可辨别此象馬等之差别。\n",
"a4_wishi2_69":"《俱舍論頌疏》卷一七：「從此大文第二，釋業道名。論\n云：如是已辨十業道相，依何義名業道？頌曰：此中三唯道，七業亦道故。釋曰：此中三唯\n道者，此十業道中，貪等三唯道也。業之道故，立業道名。謂貪等相應思，説名爲業，以彼\n貪等轉故思轉，彼貪等行故思行，如彼貪等勢力，而思有造作故，故貪等三，與思爲道。七\n業亦道故者，前七是業，身語業故，亦業之道，思所遊故，由等起思，託身語轉，故身語七\n，思所遊履，亦業之道，故前七業，業之道故，立業道名。上業身語業，下業等起思，故名\n業業。故業道者，具顯業道、業業道義。雖不同類，業道名同，而一業爲餘業，一道爲餘道\n。猶如世間，車牛名同，而一車牛名爲餘車牛故。於典籍中，如言識住。雖四識住，性類不\n同，識住名同，而一識住名爲餘識住故。離殺等七，無貪等三，立業道名，類前應釋。」\n",
"a4_wishi2_70":"粗物細物，量應平等，以粗細物體，俱遍所依境故，\n如衆燈光同滿一堂。\n",
"a4_wishi2_71":"《成唯識論》卷七。\n",
"a4_wishi2_72":"通「楷」。\n",
"a4_wishi2_73":"現量：現前、現在、顯現，三義名現。《入正理論》\n曰：「此中現量，謂無分别。若有正智，於色等義，離名（名言）種（種類）等所有分别，\n現現别轉，故名現量。」《理門論》曰：「由不共緣，現現别轉，故名現量。」《因明大疏\n》曰：「能緣行相，不動不摇，因循照境，不籌不度，離分别心，照符前境，明局自體，故名現量。」\n",
"a4_wishi2_74":"《成唯識論述記》卷一：「德有二十四種：一色、二\n味、三香、四觸、五數、六量、七别性、八合、九離、十彼性、十一此性、十二覺、十三樂\n、十四苦、十五欲、十六瞋、十七勤勇、十八重性、十九液性、二十閏、二十一行、二十二\n法、二十三非法、二十四聲。」\n",
"a4_wishi2_75":"十一根者，謂五知根（眼、耳、鼻、舌、皮）、五作\n業根（語具、手、足、小便處、大便處）、心根。（見《成唯識論述記》卷一）\n",
"a4_wishi2_76":"頗，疑爲「破」。\n",
"a4_wishi2_77":"《大乘唯識論》（真諦譯）：證智如夢中，是時如證\n智，是時不見塵，云何塵可證。如説似塵識，從此生憶持。」\n",
"a4_wishi2_78":"如：疑誤，似應作「知」。即頌「未覺不能知，夢所\n見非有」中「知」字。\n",
"a4_wishi2_79":"《俱舍論頌疏》卷十：「正邪不定聚，聖造無間餘。\n釋曰：上句標，下句釋。謂諸聖人名正性定聚，造五無間者名邪性定聚，自餘凡夫名不定性\n聚。頌言餘者，正邪定餘，即無間外餘凡夫也。」\n",
"a4_wishi2_80":"釋：（江西校勘本）原作「識」，今依大正藏本改爲「釋」。\n",
"a4_wishi2_81":"拏：大正藏作「那」。\n",
"a4_wishi2_82":"《妙法蓮華經憂波提舍》卷二：「又六根清淨者，於\n一一根中悉能具足見色、聞聲、辨香、别味、覺觸、知法，諸根互用此義應知。」\n",
"a4_wishi2_83":"前破經部極微和合成外境，曰：「然觀所緣論破經部\n師言：色等和合，於眼識等上有彼相故，設作所緣，以粗顯故，識現相故；然無緣義，無實\n體故；如眼錯亂，見第二月，彼無實體，不能生故。遂立量云：和合於五識設所緣非緣，彼\n體實無故，猶如第二月。」\n",
"a4_wishi2_84":"知：江西本作「起」，今依大正藏作「知」。\n",
"a4_wishi2_85":"議：大正藏腳註有作「證」及「成」，依前文疑應作「識」。\n",
"a4_wishi2_86":"能漸伏斷：《成唯識論》卷九作「能漸伏除」。又云\n：「此加行位未遣相縛，於粗重縛亦未能斷，唯能伏除分别二取。違見道故，於俱生者及二\n隨眠有漏觀心有所得故，有分别故，未全伏除，全未能滅。」\n",
"a4_wishi2_87":"《成唯識論》卷九：「一資糧位，謂修大乘順解脱分\n。二加行位，謂修大乘順決擇分。三通達位，謂諸菩薩所住見道。四修習位，謂諸菩薩所住\n修道。五究竟位，謂住無上正等菩提。」\n",
"a4_wishi2_88":"此下三位大師事略文取自《婆藪槃豆法師傳》（陳天竺三\n藏真諦譯），《唐高僧傳》及《宋高僧傳》。\n",
"a4_wishi2_89":"序文中的標題系編者所加。\n",
"a4_wishi2_90":"印順法師解釋為眼耳鼻舌身五根。\n",
"a4_wishi2_91":"此釋文從下一科論文後移來。講解錄音從第六講11：\n25—12：50。\n",
"a4_wishi2_92":"金陵刻經處藏要本是「離染意無有，二三成相違」。勝友\n等譯《攝大乘論》作：「若無染汚意，應無二違三」。\n",
"a4_wishi2_93":"金陵刻經處木刻本爲「餘識所聞」，今依藏要本更正爲「\n餘識所間」，餘處同。\n",
"a4_wishi2_94":"此「止」疑為「識」。\n",
"a4_wishi2_95":"此句疑為「此染污心既在定地」。\n",
"a4_wishi2_96":"《論》（卷二）云：「複如聞所成慧以聞爲先，思所成慧\n以思爲先，如是修所成慧亦應以修爲先，以其修慧從修成故。若如是者，則修所成慧前行之\n修，即是修習思所成慧所決定義，故說修慧從思慧生。以是若有幾許多聞，亦有爾多從此成\n慧。此慧幾多，其思亦多；思惟多故，從思成慧亦當不鮮。如思慧多，則多修行；修行多故\n，則有衆多滅除過失、引德道理。」\n",
"a4_wishi2_97":"對方不承認是等起善，此定之善又非勝義善或自性善\n，衹能是相應善，故云有善根與之相應。\n",
"a4_wishi2_98":"此一段釋文從下一段論文後移來。======\n",
"a4_wishi2_99":"《印順記》云：「虛妄分別，唯識學上有不同的解釋：玄\n奘傳的唯識，虛妄分別但指依他起；真諦傳的唯識，卻通指依他與徧計。」從本論文字看，\n這裏就是指依他起相，故師雲「一般」。\n",
"a4_wishi2_100":"此一段釋上一科的論文。\n",
"a4_wishi2_101":"民國七年的金陵刻經處版《攝大乘論本》無「似」字，藏\n要版《攝大乘論》亦無「似」字。\n",
"a4_wishi2_102":"藏要本作「知」。\n",
"a4_wishi2_103":"《無性釋》云：「相違識相智者：更相違反，故名相違；\n相違者識，名相違識；生此識因，說名為相；了知此相唯內心變，外義不成故無有義，說名為智。」\n",
"a4_wishi2_104":"《瑜伽師地論》第七十三卷\n",
"a4_wishi2_105":"《無性釋》云：「何處能入者，問所入境及能入位」。《\n王疏》云：「何處能入者，謂以何境界為所緣處，及何位處而能悟入也。謂即於彼大乘法相\n等所生起有見似法似義意言為所緣處，得能悟入。」\n",
"a4_wishi2_106":"《印順記》用「繩」字。\n",
"a4_wishi2_107":"疑為「諦」。\n",
"a4_wishi2_108":"疑為「悋」。\n",
"a4_wishi2_109":"此處「究竟涅槃」似指二乘的無餘涅槃，如後文有相似之\n詞：「雲菩薩其施究竟等者，謂諸菩薩不住究竟無餘涅槃如聲聞等，是故究竟常能行施。」\n",
"a4_wishi2_110":"原本作「銷融」。下同。\n",
"a4_wishi2_111":"可參《俱舍論頌疏•分別賢聖品第六》中的「明五停心位」。\n",
"a4_wishi2_112":"能海上師《戒定慧基本三學·菩提宗道菩薩戒集頌》云：\n「不具精嚴律儀戒，攝善無成他方懼。施戒忍進次第興，戒度性戒十善體，靜慮緣缺得復失\n，雙運般若但言論。自行不能全六度，別餘善法多苦集。臨陣無兵工無器，饒益有情何所依。」\n",
"a4_wishi2_113":"《印順記》云：「這菩薩雖不行施，但見他人行施，生歡\n喜心，這隨喜行施的功德，就等於自己行施。並且，菩薩攝一切眾生為己體，把他人看為自\n己一樣，通達自他平等，所以眾生行施，就是自己行施，雖自己不施絲毫，已經是廣行佈施了。」\n",
"a4_wishi2_114":"《印順記》云：佛說一切皆是虛妄，菩薩於虛「妄」法「\n中能」詳細的「說」它「為妄」，這叫「能妄語」。\n",
"a4_wishi2_115":"即中冊論文「由名前覺無，稱體相違故；由名有眾多，多\n體相違故；由名不決定，雜體相違故。」\n",
"a4_wishi2_116":"金陵刻經處藏要本注云：「藏本此語雲作損益，無力能二\n字。魏本同。」\n",
"a4_wishi2_117":"金陵刻經處民國五年木刻本是「顯」字，今依金陵刻經處\n民國七年《攝大乘論》木刻本及藏要本更正爲「行」。\n",
"a4_wishi2_118":"金陵刻經處民國五年木刻本是「行」字，今依金陵刻\n經處民國七年《攝大乘論》木刻本及藏要本更正爲「顯」。\n",
"a4_wishi2_119":"此釋文從下一科論文後移來。\n",
"a4_wishi2_120":"《王疏》云：「一轉依為相等者，謂此法身以轉捨雜\n染分依他起性，轉得清淨分依他起性為相，是即通常所謂轉識成智也。有漏染識、無漏正智\n俱待緣生，同名依他起性。漏無漏別故，染淨有殊。雖有漏染分依他煩惱善法一切皆有，不\n唯是識，識為主故，獨得識名。無漏淨分依他，亦有淨識及諸善法，智為主故，獨說其智。\n轉捨染分依他有漏識等，轉得淨分依他無漏智等，於因位中依於染識立異熟身，於果位中依\n於正智立法身等，故說法身轉依為相也。此染依他起所以名一切障者，此顯染義也。由體有\n漏故，能為一切無漏淨法障礙，令不生故，名一切障。此淨依他所以名解脫一切障，於法自\n在轉現前者，此是能對治道，能解脫彼一切障故。於彼諸障既解脫已，故能於法得自在轉，\n令得現前。謂於淨法自在能證修得，於諸染法能正知斷，是故說名於法自在轉現前。彼果斷\n分亦以轉依為相，此二別者，彼轉滅徧計所執性，轉得圓成實性，依徧計所執性立生死，依\n圓成實性立無住涅槃，是故亦名轉依。此則轉染分依他，得淨分依他也。當知彼是所證得，\n此是能證得；彼是無為功德，此則有為功德。」\n",
"a4_wishi2_121":"《無性釋》云：「由安住者，謂由安住佛法，攝持法\n身自性。轉欲行等者，謂等取勝解行等，由轉彼故證得息滅一切有情諸災患智。」\n",
"a4_wishi2_122":"金陵刻經處木刻本爲「諸」，今依藏要本更正爲「誑」。\n",
"a4_wishi2_123":"此下至「丁二 六德相應」科之前，其中，論文是前\n論文的重複，釋文取自無性的《攝大乘論釋》。\n",
"a4_wishi2_124":"《無性釋》中的頌文是「世間此別力，無故非導師。\n」故釋文所引與《世親釋》的稍異。\n",
"a4_wishi2_125":"《印順記》云：「前一頌說明一乘的目的，次一頌以\n八義說明一乘的意趣。」\n",
"a5_LS_4":"現觀：《瑜伽師地論》三十四卷，由能知智於所知境和合無\n乖現前觀察由名現觀\n",
"a5_LS_5":"八法：一切種智、道種智、一切智、圓滿加行、頂加行、\n漸次加行、刹那加行、法身\n",
"a5_LS_1":"自宗\n",
"a5_LS_2":"唸經的法本\n",
"a5_LS_3":"加行位\n",
"a5_LS_6":"對比性，刪除了\n"
}